{
  "name": "Alesso",
  "cleanBio": "Multi-platinum DJ / producer Alesso is a global sensation who’s repeatedly proven that his influence transcends universal boundaries. A pivotal name in electronic music, Alesso has amassed two RIAA-certified Platinum hits, two certified Gold singles, over 5.5 billion global streams, and countless collaborations throughout the span of his iconic career. With a diehard fanbase that reaches across the world, Alesso continues to be a symbol of musical excellence in electronic music and beyond.\n\nBorn Alessandro Lindblad in Stockholm Sweden, Alesso quickly gained mainstream recognition for his remixes of Tiësto, Swedish House Mafia, and Avicii before becoming a household name for his own productions. Upon the release of just his second single, 2012’s “Calling (Losing My Mind)” with Swedish House Mafia’s Sebastian Ingrosso and OneRepublic frontman Ryan Tedder, he was certified 2X Platinum in Sweden while also reaching no. 1 on Billboard’s US Hot Dance Club Songs. In 2014, he went Platinum in the U.S. with “Heroes (we could be)” featuring Tove Lo. His 2014 album Forever, hit #1 on Billboard’s Top Dance/Electronic Albums and #30 on the Billboard 200. Since his debut, Alesso has proven that his music can seamlessly cross over into countless genres - to that end, he’s collaborated with such eclectic artists as Katy Perry, OneRepublic’s Ryan Tedder, Calvin Harris, Tove Lo, Liam Payne, James Bay, Marshmello, Swedish House Mafia’s Sebastian Ingrosso, Hailee Steinfeld, Florida Georgia Line, Anitta, and more. On Billboard’s Hot Dance/Electronic Songs chart, his massive breakup anthem “Let Me Go” — a collaboration with Hailee Steinfeld and Florida Georgia Line — reached No. 9, while “Is That For Me” peaked at No. 25.\n\nIn 2020, Alesso released a pair of hit singles: “Midnight” featuring Liam Payne and “THE END” with goth-pop singer/songwriter Charlotte Lawrence. Soon after, he dropped his cosmic love ballad “Chasing Stars (with Marshmello feat. James Bay),”the dynamic “Rescue Me (with Danna Paola)” from the Blade Runner Black Lotus soundtrack, and his winter floor-filler “Somebody To Use.”\n\nTo cap off 2021, Alesso made his NFT debut with the Cosmic Genesis collection and dropped “When I’m Gone” — his colossal collaboration with Katy Perry. This primed fans for his 2022 releases including “Words,” a smash crossover hit with Zara Larsson, which was hailed by BILLBOARD as the top dance song of 2022. It even spawned an EP of remixes featuring artists like Chapter & Verse, Sentinel, Arodes, and Majestic. Alesso followed that up with the Sentinel- assisted house anthem “Only You” and “Dark,” an atmospheric track created for THE BATMAN movie. He finished out the year with “We Go Out,” an ecstatic dance track created with Sick Individuals. To date, Alesso has performed at international festivals ranging from Tomorrowland to Ultra Music Festival to Electric Daisy Carnival, with his national TV experience including closing out GMA’s Summer Concert Series, performing on “The Late Show with James Corden,” taking the stage at the AMAs and making his “Saturday Night Live” debut in January 2022 with Katy Perry.\n\nOver the last few years, Alesso has generated nearly 1B views on TikTok videos featuring his songs and over 2M followers on Instagram. He’s landed 3 songs (“Let Me Go,” “Heroes,” and “When I’m Gone”) on the Billboard Hot 100, and now also has over 16M followers across various social media platforms. Alesso continually pushes the boundaries with his ever-evolving sound, proving that his impact will remain as timeless as his music for generations to come. 125%",
  "genres": [
    "Progressive House",
    "Electro House",
    "Future House",
    "Big Room House",
    "Pop Dance",
    "Melodic House",
    "Dance Pop",
    "Deep House"
  ]
}