{
  "name": "Alison Wonderland",
  "cleanBio": "When it comes to making music, Alison Wonderland has always worn her heart on her sleeve. Her songwriting — visceral and raw — takes lines that feel like entries from her own diary and twists the familiar burns of heartache and hurt into empowering mantras for festival crowds around the world to sing along to. Her production is as explosive as it is delicate, channeling intricate, uncompromising beat work and blending in the unexpected, like cello breakdowns, amongst swinging trap, bass beats, and dynamic, futuristic soundscapes. Alison Wonderland is unapologetically herself and has shattered the status quo with her fearless approach to redefining what experimental pop electronic music can and should be.\n\nNever one to color in between the lines, Alison Wonderland has done things differently even from the onset of her musical career. In her formative years, she was a cellist with the Sydney Youth Orchestra by day, while moonlighting as a bass guitarist in local bands by night. Making her way around Sydney's nightlife circuit, she was eventually introduced to DJing and learned the magic of producing and making her own music.\n\nAlison Wonderland the project debuted in 2009 and her ascent since has been uncontainable. She rose up a beacon of Australia's vibrant electronic music scene, first garnering international recognition for her creative and genre-defying DJing while also carving out her role as a household name producer, starting with remixes for the likes of pop giants like Justin Bieber. Soon after, her talents as a triple threat producer, singer, and songwriter took center stage when she debuted with her album Run. Her debut album was her first to hit No. 1 at the top of Billboard's Top Dance/Electronic Albums Chart and was also nominated at the ARIA Awards. She then arrived in the US with a bang for her first performance stateside, landing on the stages of the hallowed Coachella. Typically, a Coachella performance is a milestone that takes a hopeful artist years and years to reach — for Alison, it was merely a marker of what was yet to come in her new home base in California. Only a few years later, she would go on to make history at the festival when she became the highest female DJ to be billed across all of Coachella's storied lineups.\n\nCementing her place as a champion of Australia's explosive pool of electronic talent and as a beloved headliner on festival billings was just the beginning. Alison Wonderland has also been recognized as Billboard's Breakout Artist of the Year, the Electronic Music Awards' Best New Artist, and received multiple nominations for her records at the ARIA Awards. Named by Billboard as a \"prodigious creative\" and described by The Fader as \"unexpected and amazing,\" it's clear that Alison Wonderland has created something special.\n\nHer 2018 album Awake was her second No. 1 Billboard Dance/Electronic Album chart-topper. The album saw her level up as a producer, working with a diverse array of revered collaborators like rap stars Trippie Redd and Chief Keef as well as producers for the stars Joel Little and Illangelo. Her subsequent tour hit historic venues across North America and included sold out nights at the Bill Graham Civic Auditorium, WaMu Theater, and two nights at the Red Rocks Amphitheater in Colorado.\n\nEverything has changed since Alison Wonderland released her last record in 2018. The world turned upside down when a global pandemic wiped out \"normal life\" as everyone knew it. Life, as it was, came to a screeching halt — especially a life full of live music, shows, and touring. Like many, Alison Wonderland found herself suddenly very still, and very alone.\n\n\"My life was going a certain way before something pulled everything out from under me,\" she describes. \"It left me entirely alone, and it all happened around the same time as COVID. I felt like I had hit my rock bottom.\" Having always turned to making music to process, she began to ruminate on the beginnings of her third album, Loner. Like rereading the pages of old diaries, she revisited her own albums for the first time in a long time. \"I realized that I have always seen myself as the victim of my story. This time, something shifted in me, and I decided that I didn't want to be the victim anymore. Instead, whatever I wrote from here would empower me, and help me find strength in this loneliness.\"\n\nThroughout her career, Alison has consistently been a courageous advocate for mental health discussions and her own struggles with depression. Staying true to her message with Loner, she writes with a captivating new assuredness in the light that comes after the storm. \"It's the most positive, hopeful album I have ever written,\" she shares. \"It acknowledges the darkness, but creates its own euphoria through it.\"\n\nLoner captures Alison Wonderland at her best; an exhilarating juxtaposition of lyrics and sound, the album is as bright as it is brash. Her songwriting, sharper than ever, is disarmingly genuine and wickedly clever. Longtime fans will know that Alison Wonderland has always faced her own experiences of loss, hurt, and unbridled passion head on through her music, but with Loner, there exists an undeniable new draw in her explorations of hope and perseverance. \"For me, Loner felt like a rebirth.\" With her latest, Alison Wonderland transforms darkness into light, disorder into order. \"I owe it to whoever else is out there who was like me, wishing that they had an album like this to empower them to feel less alone and know that it's all going to be okay one day,\" she says. In 2022, as we emerge from past years of cloudy, turbulent change, Loner has arrived just in time to remind us to look ahead to a better tomorrow.",
  "genres": [
    "Trap",
    "Future Bass",
    "Experimental Pop",
    "Electro Pop",
    "Bass",
    "Electro House",
    "Dubstep",
    "Indie Electronic",
    "Progressive House",
    "Electronic Rock"
  ]
}