{
  "name": "Alok",
  "cleanBio": "ALOK is a bonafide dance music superstar and philanthropist holding the title of the second biggest Instagram following of any electronic artist globally, with 28 million fans. On Spotify, Alok concentrates more than 20 million monthly listeners and 5 billion streams, making him the second most listened to Brazilian artist internationally. In 2022 he was named the 4th Best DJ in the world, according to the prestigious DJ Mag Top 100 DJ Poll. Alok is also the only Brazilian to make the “Billboard Dance 100” and was named in 2022 by Bloomberg Linea as one of the 500 most influential people in Latin America.\n\nPerforming some 320 shows on five continents yearly, Alok is widely regarded as one of the most influential Brazilian artists of all time and is experiencing his breakout moment in the US. From working with and lending his remix work to artists including The Rolling Stones and Zara Larsson, from Jason Derulo to Tove Lo and more, he won the “Best Remix” award at the 2020 International Dance Music Awards for his hit remix of the Meduza’s single ‘Piece of Your Heart’ (over 223 million streams), also partnering with global pop sensation Dua Lipa for the official remix of her hit single ‘Physical’. In 2021 he collaborated with Grammy award-winning pop sensation John Legend on ‘In My Mind’, also with renegade vocalist John Martin, as well as lending his craft to remix multi-platinum, #1 artist Ed Sheeran.\n\nAfter an already hugely successful start to 2022 and hot off the back of the announcement of his debut Ibiza residency at Hï Ibiza, he brought the smash hit of the Summer ‘Deep Down” alongside Ella Eyre, Kenny Dope and Never Dull. The song reached #1 on the Billboard Dance Chart for 4 weeks in a row. Most recently, Alok joined forces with multi-platinum singer/songwriter Ellie Goulding and British DJ/Producer Sigala for the dance-pop anthem \"All by Myself\", which brings the timeless sample of Depeche Mode’s \"Enjoy The Silence.\"\n\nAlok is also a recognized brand and star, having achieved huge notoriety in the gaming world as a character, with his own name, in the wildly popular game “Free Fire.” Two years ago, he created the Instituto Alok, which manages high-impact philanthropy projects in Brazil and Africa. To date, the institute has donated more than 10 million dollars to social and environmental projects worldwide.\n\nAlok was also recently part of the revolutionary Global Citizen Live series of worldwide performances alongside names including Billie Eilish, BTS and Elton John, streaming live with glorious cinematics direct from the Amazon rainforest alongside the Guarani indigenous people to support poverty and climate change.\n\nIn 2022 he launched his remarkable climate change partnership with the United Nations’ Global Compact, “The Future Is Ancestral,” which featured workshops, panels and conferencing on sustainability and environmentalism, and included a landmark performance on the rooftop of the United Nations headquarters alongside Indigenous tribal leaders.",
  "genres": [
    "Brazilian Bass",
    "Dance-Pop",
    "House",
    "Deep House",
    "Progressive House",
    "Future House",
    "EDM",
    "Tropical House",
    "Electro House",
    "Tech House"
  ]
}