{
  "name": "Andy C",
  "cleanBio": "With over 40 awards to date, Andy C's career has been nothing short of a phenomenon. He's sold-out Alexandra Palace and Brixton Academy with his own solo shows, played headline slots at the world's greatest festivals including Creamfields, Glastonbury, EDC, and SW4, and released a string of phenomenal crossover anthems like 'Heartbeat Loud' and club cuts like 'New Era'. He's also the go-to remixer for the likes of Major Lazer, Sigala, London Grammar and beyond, and the d&b figure recently chosen to host the first drum & bass radio show on Apple Music's Beats 1, broadcast to over 100 countries.\n\nA reputation as one of the most significant British artists in global dance music has been hard earned, but it's hard to place the tipping points. Was it his performance at Radio 1's Hackney weekend, where his set was watched online by more people than either Jay Z or Rihanna? When he performed to 85,000 people at Glastonbury in 2013? When he sold out Brixton Academy in 10 minutes? Or when his remix of Major Lazer charted on iTunes after being added to the Radio 1 Playlist?\n\nAndy's success and status as a festival main stage headliner and DJ who guarantees sell-out roadblocks is driven by a phenomenal work ethic and the kind of tour schedule that makes rock bands look like part-timers.\n\nAs the owner and figurehead for Ram Records, Andy's nurtured and developed huge headline artists such as Chase & Status, Wilkinson and Sub Focus, turning it into one of the world's most respected independent operations across recordings and now festivals like EDC Las Vegas, Creamfields, and SW4 where Ram have hosted their own arenas and stages.\n\nAndy's main signature motif as a DJ is that he's guaranteed to be packing tracks that no other DJ has. Hunting, digging, searching and signing: he is constantly immersed in new music. Not only does this ensure a wholly unique experience when you see him live, but it also gives Ram Records a front row seat when it comes to spotting new artists... As the likes of Loadstar, Wilkinson, Calyx & TeeBee, Frankee, Delta Heavy, Culture Shock, DC Breaks, Hamilton, Mind Vortex, Chords and many more exciting talents will happily confirm.\n\nOn 31 March, Andy completed his 13 week residency run at XOYO. The first d&b artist chosen by the renowned London club, tickets for his entire residency sold out far in advance. The Friday night run allowed Andy to nurture a weekly crowd on a par with his legendary sets at The End, bringing together older heads and d&b's new converts together under one roof.\n\nSummer 2017 festival dates include Lovebox, Let it Roll festival, Snowbombing, Lost & Found, Wild Life, Parklife, Dour Festival, Nu Forms, Boardmasters, Dreambeach, Innovation in the Sun, Tomorrowland, Reading Festival, Leeds Festival, Bestival, Middlelands and many more to be announced.\n\nAndy's latest club track 'What Bass', his first new music in 12 months, is available now on Ram Records. Further releases are set for the rest of the year.",
  "genres": [
    "Drum and Bass",
    "Jungle",
    "Drumstep",
    "Liquid Drum and Bass",
    "Dubstep",
    "Electronic Dance Music (EDM)",
    "House"
  ]
}