{
  "name": "Ben Nicky",
  "cleanBio": "Making noise as one of the busiest electronic artists on Earth, Ben Nicky is poised to take on the world. Earning supreme accolades from industry trailblazers, Ben is recognized by Diplo as the “leader of a new movement” and by Armin van Buuren as “one of the hardest working DJs in the industry.” Reaching new heights with chart-topping hits across Beatport, Spotify, and iTunes, Ben has become a household name across the dance music spectrum with his penchant for fast-moving beats. Coined by Pete Tong as a “multi-genre specialist” and “one of the planet’s busiest DJs,” Ben continues to lead fans and artists alike on social media to millions of online followers.\n\nBehind the decks, Ben Nicky’s open-format DJ sets range from 125 BPM up to 200 BPM without missing a beat. It’s his unique yet recognisable style that’s led him to become one of the world's strongest-selling dance acts across the UK, Australia, United States, Asia, and beyond. In Northern Ireland alone, Ben is the highest-selling DJ of all time with multiple sold-out shows at Belfast’s Ormeau Park, SSE Arena, and Custom House Square as a headlining act.\n\nWith crowd-pleasing beats and fast-paced flair, Ben has performed at iconic festivals including EDC Las Vegas, Tomorrowland, Ultra Music Festival, Creamfields, and more. As one of the world's most travelled artists, Ben has well and truly tattooed his mark on the global events circuit.\n\nIn the studio, Ben consistently makes magic. His 2021 rework of Faithless’ “We Come 1” has garnered over 1 billion views worldwide and continues to see primetime radio airplay. With over 20 number-one hits across multiple genres on Beatport and repeated high placements on the iTunes UK Top 100, Ben is no stranger to a dance floor smash. Along with his solo releases, Ben regularly collaborates with superstar acts, including David Guetta, Nicole Scherzinger, Dimitri Vegas & Like Mike, Diplo, Steve Aoki, Armin van Buuren, Timmy Trumpet and legendary rock artist Sting. In 2019, Ben made his Essential Mix debut on BBC Radio 1 with two blistering hours in the mix.\n\nThrough his devoted social media presence, Ben has earned hundreds of millions of organic views across platforms since 2016. Any dedicated raver will find Ben’s engaging videos or his latest track on their timeline, speaking to the power of his far-reaching brand. Undoubtedly one of TikTok’s biggest stars, Ben has received over 1 billion views on the platform alone.\n\nWith a thirst for innovation and the savvy to consistently think outside the box, Ben Nicky is one of the most dynamic musicians in the world. As his relentless touring and release schedule continues to propel him into the stratosphere, Ben and his army of devoted Misfits are primed to take on the world.",
  "genres": [
    "Trance",
    "Psytrance",
    "Hardstyle",
    "Progressive House",
    "Techno",
    "Big Room House",
    "Drum and Bass",
    "Dubstep"
  ]
}