{
  "name": "Ben Sterling",
  "cleanBio": "Influenced by his family’s golden 70-80s Disco collection, modern Electro and with an insatiable passion for the history of Chicago House and Detroit Techno, self-taught DJ and producer Ben Sterling continues to count some of the most influential tastemakers in international electronic music as supporters - and with good reason. His sets and productions brim with Acid House and Raw Electronic Groove, blended together with a mesmerizing uplifting fluidity that belies his age.\n\nChampioned by Jamie Jones, Marco Carola, The Martinez Brothers, Eats Everything, Patrick Topping, and even gaining support from global superstar Calvin Harris, Sterling has already featured on Hot Creations twice, Edible, Hottrax and Origins Rcrds – and was one of the first residents hand-picked by Josh Butler himself. At just 18, his residency at London’s Ministry of Sound marked him out as one to watch. It wasn’t long before he began to come through on the early promise. His Origins release ‘Ciao’, a record that soon caught the ears of Hot Creations and Paradise boss Jamie Jones.\n\nThe UK legend dropped seven of Sterling’s unreleased productions during a single EDC Las Vegas set, showing the same level of support at shows across Paradise, Coachella, Circoloco, Timewarp, Burning Man and many more, to later sign two consecutive EP’s to Hot Creations that same year. Now an established name in the house and techno scene, Ben has performed at a number of iconic clubs and festivals around the world, including DC-10, Resistance, HYTE, Paradise, elrow, Straf\\_Werk, The Warehouse Project, The BPM Festival and many more. On the road Ben has also shared the stage with many greats such as Jamie Jones, Marco Carola, Joseph Capriati, Nina Kraviz, Solomun, Ben Klock, Apollonia, Patrick Topping and Enzo Siragusa, to name a few.\n\nWith his eye now firmly on the rest of 2019 - which he kicked off in style as Danny Howard’s first “Future Fire” guest of the year on BBC Radio 1 - Sterling looks certain to continue on his trajectory towards the upper echoelons of dance music.",
  "genres": [
    "House",
    "Tech House",
    "Acid House",
    "Techno",
    "Deep House",
    "Minimal Techno",
    "Disco House",
    "Progressive House"
  ]
}