{
  "name": "Ben Hemsley",
  "cleanBio": "Standing out from the masses with his daring and captivating productions, Newcastle-based Ben Hemsley is a force to be reckoned with. Ben Hemsley is the hottest ticket in the UK house and techno scene right now. In 2023 Ben sold out b2b shows at Liverpool’s iconic Blackstone Street Warehouse, selling 7000+ tickets and achieving the two fastest-selling shows in the venue's history. He then went on to sell out WHP ludicrously fast with general on sale lasting 5 minutes! This was just one of nine shows that made up Ben’s CONNECTION TOUR, a run of shows at the best venues in each city in the UK. Ben sold out the entire tour, selling close to 30,000 tickets in the process. Ben Hemsley also launched his own Ibiza residency in 2023 selling out every show and establishing one of the most successful events on the island! And with 2024 fast approaching there’s no sign of Ben slowing down anytime soon as he readies the return of his Ibiza residency in the Summer of 2024 and announces his biggest show to date, a massive 12,000 capacity headline show at Liverpool's Pier Head.\n\nWith luring melodies and flavours of old school rave nostalgia, Ben’s records have been highly coveted by the leading labels in dance music, with signings on Ministry of Sound, Trick, Arcane, Repopulate Mars, Stress, Sola & more, not to mention his own imprint Bebé. Inspired by an early exposure to his mothers passion for 90’s dance music, Ben’s originality has turned the heads of some of the biggest names in the scene such as Patrick Topping, Calvin Harris, Tiesto, Fatboy Slim, Eli Brown, blk, Deborah De Luca, DJ Daddy Trance, Denis Sulta, Green Velvet & Fisher to name a few. His tantalising skills as a producer came to light in 2021 with hits ‘Through 2 You’, ‘Bebe Musica’ & ‘Love, Peace & Harmony’, not to mention his fan favourite 2022 release ‘Erase Me’. Ben became the pinup boy for BBC Radio 1. Accolades included a nomination for Breakthrough Artist of the Year at the Radio 1 Dance Awards, a Dance Anthems Hottest Record In The World, Playlist additions, multiple tracks of the week & more. Not just a talent producer, Ben also decided to create and launch his own label bebé with the aim of creating a space to delve deeper into his influences and become a tastemaker carving out his own scene and shining light on up and coming, like-minded artists.\n\nWidely renowned as one of the hottest talents in dance music today, Ben strides confidently into 2024 excelling in every way he can.",
  "genres": [
    "House",
    "Techno",
    "Trance",
    "Rave",
    "Progressive House",
    "Tech House",
    "Dance",
    "Breakbeat",
    "Deep House",
    "Minimal"
  ]
}