{
  "name": "Billy Gillies",
  "cleanBio": "Billy Gillies is the latest superstar trance artist to emerge from Northern Ireland.\n\nOver the past few years, the Belfast native has cemented his place as a mainstay headline act. His midas touch in the studio and unforgettable live DJ shows have made him a go-to artist for every top record label, club and festival in planet trance.\n\nYou just know when it's a Billy Gillies track, whether it's uplifting trance with his signature soaring emotional melodies, his distinctive high energy tech trance and hard-edged productions, or even a more commercial sound, Billy stamps his authority on every track and is a born hit maker. Already securing eight number 1 spots on Beatport, millions of Spotify and YouTube streams. Amassing a loyal army of fans from his explosive DJ sets plus original productions, collaborations, remixes and huge reworks. Add to that Billy's more commercial dance tracks (Lagoon and Youth) which took the TikTok generation by storm.\n\nGlobetrotting as a touring DJ, adding new countries every month having already performed in North America (LA, Toronto), Asia (Bangkok, Ho Chi Minh City), Australia (Melbourne, Sydney), South America (Buenos Aires), UK (England, Scotland, Wales, Northern Ireland and all over Europe (Netherlands, Ireland, Poland, Germany, Czech Republic, Romania). Playing for mega brands such as Creamfields, FSOE, Subculture, Luminosity, Dreamstate, Unkonscious, Untold, Rong, Ministry Of Sound, Colours, Ben Nicky & Friends, Belsonic, Planetlove, Notorious Parties, Shorefest and many more.\n\nChart topping collaborations with the Egyptian trance gods Aly & Fila (Kings FSOE 750 Anthem), teaming up with comrades Sneijder (Rhino) and Shugz (The Journey) and remixing for Irish trance don John O'Callaghan (Mess Of A Machine). Vocal smashes with Aly & Fila, Luke Bond & Audrey Gallagher (A Million Voices Remix), Chelsea Holland (Defender), George Acosta & Fisher (True Love). Officially remixing classics (Alena - Turn It Around and Conjure One feat Sinead O'Connor - Tears From The Moon). A leading light on labels such FSOE, Armada, Black Hole, Subculture, Damaged, Afterdark and more.\n\nBilly Gillies is one of the hottest tickets in town and one of the most sought after acts on the York Artists roster, so don't miss his next appearance as he continues to create memories for a lifetime with next level studio output and stunning live DJ performances across the globe.",
  "genres": [
    "Uplifting Trance",
    "Tech Trance",
    "Hard Trance",
    "Commercial Dance",
    "Progressive Trance"
  ]
}