{
  "name": "Charlotte de Witte",
  "cleanBio": "No Sleep.\n\nA mindset and work ethic claimed by many but endured by few.  Charlotte de Witte’s astronomic rise to the top of the charts is undeniable. The Belgian born superstar’s astronomic rise, has brought her a long way from her early beginnings in small venues around her hometown of Ghent ten years ago.  Her global expansion has resulted to Charlotte de Witte being one of the most sought-after names in electronic music today.\n\nWith highlight performances at renowned festivals and acclaimed clubs Charlotte de Witte has managed to capture audiences attention all around the globe. Winning the hearts of electronic music lovers across the continents, who adore and support her every move. Whether they’re packing out venues, streaming releases or rewatching her sets online; they’re there for her. Making Charlotte de Witte one of the strongest & honest personalities in media. Graced with Mixmag & DJ Mag covers, high-ranking positions in the charts & lists and owner of one of the strongest social media profiles in music today, only confirm her status as nouveaux techno royalty.\n\nThough these soaring statistics, extensive acknowledgements from respected press & gatekeepers and acclaimed accolades such as Best Techno at the DJ Awards in 2019 are honoring validations of de Witte’s hard work, they do not drive her. It’s her everlasting pursuit to push her boundaries and those of electronic music.  The mind-boggling tour schedules, high charting remixes, numerous releases on respected labels and high profile residency at BBC Radio 1; have brought her to the start of her most challenging and extensive endeavor yet, the launch of her own label under her flagship KNTXT.\n\nFounded in 2015 at the legendary Fuse club in Brussels, KNTXT has grown from a live event; to a boutique label that organizes events, releases music and curates radio shows.  KNTXT stands for purity, strength & progression within a vibrant and ever evolving techno scene. Head honcho Charlotte de Witte ambition holds no boundaries as she pursues to build a platform for emerging talent and output for her creative aspirations.\n\nWith no intention of slowing down Charlotte de Witte is a force of nature to be reckoned with.",
  "genres": [
    "Techno",
    "Acid Techno",
    "Minimal Techno",
    "Electronic",
    "Hard Techno",
    "Tech House",
    "Progressive Techno",
    "Deep Techno"
  ]
}