{
  "name": "Chase & Status",
  "cleanBio": "Talk about high expectations. When London drum’n'bass duo, Chase & Status aka Saul Milton (Chase) and Will Kennard (Status) first laid down the tracks that would make up their third studio album, they were faced with a weighty dilemma: how to follow the sizeable footprint left by 2011’s multi platinum selling No More Idols, not to mention their hefty rep as festival headliners? The answer was found with Brand New Machine, an album that brims with surging, dancefloor anthems, dusty trip hop grooves as championed by the likes of Massive Attack and Portishead, and a collection of jungle and garage breakbeats that increase with substance over repeated plays. Meanwhile, brooding ragga harmonies and hip hop samples deliver an updated take on No More Idols’ anthemic, catch-all appeal. The overall vibe? An instantly memorable collection of swaggering cuts tuned to a club setting, hyped summer festivals and arenas alike. “This album was more about getting down what we were feeling, what we were into and what sounded good. No More Idols greatly exceeded our expectations, which was an incredible feeling and something we hadn’t planned. It was a real buzz.” “This time around I guess we found the inspiration for what we wanted the album to sound like in our own record collections and experiences. We were born in the ‘80s, we grew up in the ‘90s, we went raving, we went to rock gigs. That scene, that vibe, that culture; the rude boy clothes, the end-of-the-weekend club scene going to see Jumpin’ Jack Frost it all seeped into the recording. The Prodigy, Massive Attack, the east coast and west coast rap sound…those things pushed us to get the tunes down. That was the inspiration for the record. We didn’t want to follow the crowd, we wanted to do what sounded good to us.” Meanwhile, their studio quickly became a revolving door for the dance scene’s emerging singing talent. A role call of sensations-in-waiting were invited to lay down vocals on a string of tracks, and appearances by studio debutants, Louis M^ttrs, rapper Knytro and the smoky tones of Brighton singer, Elli Ingram followed on from Chase & Status’s previous work with A-listers, Plan B, Tinie Tempah, indie doom-mongers White Lies and greats such as Cee‐Lo Green and Rihanna. “We used so many great singers in the recording process,” says Milton. “As with all our records, we liked working with interesting people like Nile Rodgers, and Pusha T, plus some newer, rawer names like Moko. But it was more exciting for the newer guys, they had passion and desire; that feeling of want. We’ve worked with artists who have gone on to do huge things after working with us… but they change! They aren’t the same in the studio anymore (once they make it big). They don’t have that same explosive desire that they had before. I love the eager vibe.” An album’s worth of tracks were recorded. As the spring of 2013 became summer, Chase & Status made a series of appearances on the festival circuit, road-testing new material along the way. First up was Radio 1’s Big Weekend Festival. “We performed (first single) Lost And Not Found with Louis M^ttrs who’s just the loveliest kid in the world. We asked him to come on the road with us; we threw him in the deep end massively because it was his first gig. I remember saying to him before he stepped out in front of 30,000 people, ‘Have you ever sung in front of anyone before?’ And he said, ‘Nah, just my dad and my uncle…’ Then he walked out to a huge crowd. But he smashed it and took it in his stride.” Next came their prestigious headline slot at Glastonbury, opposite The Rolling Stones, on the Other Stage, where Heaven Knows was premiered with Elli Ingram. “The way she moved onstage was so cool,” says Kennard. “Seeing her sing in front of that crowd was amazing, she has a cool sound already, and she has an incredible presence on stage. Elli’s a real talent.” Next followed a string of headline performances around the UK and Europe including T In The Park, Lowlands Festival and closing the main stage at Roskilde after Metallica. To round up another phenomenal summer on the festival circuit the band performed their storming, riotous show at Reading and Leeds Festival, on the Main Stage before Eminem. It was such a wild show that they had to stop the music multiple times to get the crowd to take a step back, reducing the crush at the front. Melvin Benn, the owner of Reading and Leeds, went on to say they were definite one day headliners. With the songwriting process completed, what followed was a period of soul searching as the duo took to polishing 14 tracks into an album that lived up to their high expectations. “We’re perfectionists,” says Milton. “It’s a gift and a curse at the same time. There’s a standard we won’t go below, which is great. But it also sends us around the bend because we go around the houses before we’re satisfied. We’ll write a track and then make 20 versions of it. All of them are very different.” “It drives us mad. Then after making 20 versions we usually realize that the first version was the best. It’s just about being tough on ourselves; we have high expectations of what we do. That’s when it becomes a job and we tend to go right to the wire until somebody tears the album from us so they can release it. Hopefully the results of that process make it worthwhile.” The hard work and perfectionism paid off when Brand New Machine stormed the UK charts at #2 and is currently quickly approaching Platinum status, not to mention closing the year with their first UK arena tour seeing the live band perform to over 80,000 people, which culminated in a phenomenal sold out homecoming show at London’s 02 Arena. It’s not as if Chase & Status are without history in the production process, however. For the best part of 10 years, Milton and Kennard have continually pushed drum’n'bass’s experimental spirit into increasingly brave, unchartered areas - rock, reggae, hip hop and soulful club grooves are just some of the genres that have been underpinned by their love for clattering breakbeats. Remixing for the likes of Jay Z and The Prodigy, Milton and Kennard have had six tracks feature on three of Rihanna’s smash hit albums as well as Snoop Dogg requesting to write on their early hit ‘Eastern Jam’ transforming it into ‘Snoop Dogg Millionaire’. With Brand New Machine’s kaleidoscopic sound, they’ve rebooted their reputation as the one of most exciting production teams on the scene. “I guess that’s happened because we have good foundations,” says Kennard. “When times are hard in this studio and we think, ‘This is all rubbish’, I always remember what we used to do when we first started. Like driving up the M1 to do a gig in Manchester and then driving back to Leeds for 6am - in a battered Peugeot 206 ‐ to do an early morning show for a couple of hundred quid. We remember what we loved about doing this in the first place ‐ the music.” 2014 saw Chase & Status complete another huge summer of touring the festival circuit with their live show, taking in slots at Global Gathering, Benicassim and an explosive headline slot in their hometown at London’s Lovebox Festival. Alongside these festival commitments, they were also the first bass music act to be given a weekly residency at Amnesia, one of Ibiza’s biggest and best-known clubs. At the end of 2014, Chase & Status and Rage teamed up with David Rodigan and Shy FX to form Rebel Sound, a dub dream team initially brought together to compete in the Red Bull Culture Clash at Earl’s Court. Rebel Sound took on 3 other crews - London grime collective, BBK; Reggae legends, Stone Love; and New York’s A$AP Mob and in front of a 20,000 strong crowd, won the title of Culture Clash champions for 2014. 2015 sees the duo head back to the studio to work on new material together while they continue to tour worldwide.",
  "genres": [
    "Drum and Bass",
    "Dubstep",
    "Jungle",
    "Trip Hop",
    "Garage",
    "Dub",
    "Hip Hop",
    "Breakbeat",
    "Reggae",
    "Electronic Rock"
  ]
}