{
  "name": "Cole Knight",
  "cleanBio": "Cole Knight has just played her first Coachella—a sure-fire marker that she’s an artist on the rise. Having recently made her mark playing shows around LA as well as in Tulum, where shesaw out the pandemic. Cole Knight has been on a journey of self-discovery, and she’s findingherself on the dance floor.\n\nKnight grew up in a small rural town about three hours south of Chicago, in a household where music almost never played. Despite this, she was drawn to music anyway, clamouring to use iTunes whenever she could and making mix CDs for her friends. Besides a brief stint learning piano and a longer, more dedicated stint learning guitar, Knight’s exposure to music up untilleaving high school was minimal.\n\nAfter school, Knight studied computer sciences at Michigan State University, where she ran cross country and track for the college team. In her junior year Knight decided to put her studies on hold to travel around Europe on modelling assignments, taking time to dive into the culture and music in cities like London, Milan and Paris. During this time, Knight downloadedRekordbox and started experimenting with DJing whenever she had free time.\n\nWhen Knight returned to school to finish her studies, she began picking up DJ gigs in the bars around campus. Upon graduating she set her sights on Los Angeles. After initially feeling intimidated by the scene there, she slowly made more connections by sending her mixes out to promoters, and gradually started picking up gigs at warehouse parties, after hours events and even soundtracking yoga classes.\n\nIn the time since, Knight has been honing her craft and defining her sound—deep, grooving house, hypnotic rhythms, atmospheric synths, trippy textures and the occasional catchy vocal or classic dance tune thrown in. To date she has shared a bill with the likes of Diplo and DJ Tennisin Las Vegas, Damian Lazurus and Swedish House Mafia at a Coachella after party and warming up for Black Coffee at Zamna in Tulum.\n\nAs Knight looks forward into the rest of 2022 and beyond, she’s allowing her intricate understanding of sound and her experience behind the decks to inform her first foray into production. “I want to put my flavour into the world,” she says. “It’s going to be a reflection of me, the places I travel to and the experiences I have with the people I meet. It’s going to be groovy, that’s for sure.”",
  "genres": [
    "Deep House",
    "Tech House",
    "Progressive House",
    "Minimal House",
    "Melodic House",
    "Electronica",
    "Downtempo",
    "Ambient"
  ]
}