{
  "name": "David Forbes",
  "cleanBio": "With an illustrious musical career spanning nearly two decades and a production discography that would make any A-list electronic music producer proud, David Forbes stands as one of the UK's most respected and versatile artists of our time.\n\nDavid's journey in the world of electronic music began during its formative years, granting him unparalleled experience and industry insight that few can match. He has mastered a diverse range of styles, making him a go-to producer for some of the most esteemed labels in the electronic music scene.\n\nDavid's work has graced labels such as WAO138, Subculture, Armind, Outburst Records, ITWT, Statement, Anjuna Beats, Vandit, Spinnin, Reset, Oxygen, Perfecto, Liquid, Doorn, Ferry Corsten's Flashover Recordings, Captivating Sounds, and many more. His productions have found their way onto legendary compilations curated by the likes of Paul Van Dyk, Armin Van Buuren, Ferry Corsten, Sander Van Doorn, Markus Schulz, Above & Beyond, Gareth Emery, and the iconic Tiesto - who featured 'Answers' on his legendary 'Tiesto in Concert' DVD, David being the only UK artist featured.\n\nIn addition to his solo releases, David Forbes has collaborated with some of the electronic music scene's finest talents, including Mark Sherry and Alan Nimmo (Signalrunners). Notably, David was a pivotal member of the platinum multi-million-selling group Public Domain and Scanners.\n\nDavid's performances have graced stages in Ibiza, Holland, Brazil, Ukraine, Hong Kong, Austria, Bangkok, Kuala Lumpur, Mexico, and prestigious festivals such as Poland's Sunrise Festival, Dreamstate, and Germany's Nature 1 Festival - sharing the stage with Deadmau5. He has also appeared at The Reading & Leeds Festival, Homelands, Coloursfest, Ministry of Sound (Singapore & London), Full on Ferry, Colours, Inside Out, and multiple Tiesto shows in Scotland, including his iconic SECC world tour. Impressively, David has completed 13 interstate tours of Australia, headlining the Utopia event in front of 20,000 people in the Sydney Super Dome stadium.\n\nOn the label front, David's own Aria Digital & Midimal labels have continued to flourish, with the former celebrating its 100th release. These labels provide a perfect platform for David's latest collaborations and offer an opportunity for budding talents in the electronic music scene.\n\nOver the past 15 years, it's rare to find a DJ who hasn't included a David Forbes production, or one of his many aliases, in their sets. With almost two decades of experience in both production and DJing, David Forbes stands as a testament to the perfect modern-day electronic artist, and his legacy continues to reverberate through the world of electronic music.",
  "genres": [
    "Trance",
    "Progressive Trance",
    "Tech Trance",
    "Uplifting Trance",
    "Psytrance",
    "Techno",
    "Progressive House",
    "Electro House",
    "Hard Trance",
    "Hard Dance",
    "House"
  ]
}