{
  "name": "Deorro",
  "cleanBio": "For over a decade, Los Angeles-born and bred producer Deorro, or Erick Orrosquieta by name, has transcended musical styles, international borders, and broken cultural barriers with his genre-defying expertise. Armed with the same songwriting mastery and musical fluidity of his formative years as a bedroom producer and local hero, Deorro is now a globally-certified, chart-topping, platinum-selling artist.\n\nThe world was introduced to Deorro’s signature style in 2013 via “Yee” – his first major label release signed to Hardwell’s Revealed Recordings. A foreshadowing of greatness, “Yee” charted worldwide across Austria, Belgium, France, Germany, The Netherlands, and Switzerland. Deorro crossed over into the mainstream landscape in April 2014 with his groundbreaking single “Five Hours.” A quantum leap in his career, the track was a testament to his formidable sound design and dedication to sonic excellence. Equipped with warping crescendos, futuristic beats, and cerebral soundscapes, “Five Hours” went on to become a worldwide success charting in multiple countries including a #8 spot on SNEP official French Singles Chart and peaked at #1 on Billboard’s Dance Airplay chart. Like a detonated grenade, “Five Hours” initiated a seismic wave of non-stop momentum leading to a series of accolades including a guest cameo on MTV’s Teen Wolf and a commendable ranking in DJ Mag's Celebrated Top 100 DJs annual poll at #19 – the highest new entry of 2014. That same year, Deorro released his spanish hit “Perdoname” featuring DyCy and Adrian Delgado which garnered over 53 million plays across streaming platforms, won Best Latin American DJ at the EMPO Awards and now stands as a 2x Platinum record.\n\nBreaking into spaces outside of dance music, In 2015, Deorro teamed up with Grammy Award-winning R&B icon Chris Brown for their critically acclaimed track “Five More Hours.” The collaborative hit accelerated Deorro’s career to an unprecedented upward trajectory with the chart-topping track receiving more than 19 global certifications, 330 million Spotify streams, and over 200 million YouTube views and counting. A proud Mexican-American and voice for the Latin music community, his Latin/EDM hybrid single “Bailar” is now an 8x Platinum-certified hit that went on to win Latin Billboard’s Tropical Song of The Year along with a subsequent recording with esteemed musical legend and performer Pitbull.\n\nAn amalgamation of years of success and collaborative excellence, Deorro’s 2017 debut album Good Evening brought together the sounds, styles, and influences that levitated him to fame. Signed to Ultra Music, Good Evening is a versatile venture into sound-design. A conceptual LP with a staggering 24 tracks, the project is equipped with intros, outros, interludes, and story-telling. A narrative outline of the many subgenres that make-up the spectrum of dance music, Good Evening captures the wonders of future bass, dubstep, jazz-swing, and more. The album stacked a laundry list of accolades ranking high in the Apple Music Dance Album charts around the world, including #1 in two countries, #4 in France, #19 in Australia, and reached the Top 50 in Apple Music’s overall chart across six countries. With releases spanning major labels like Interscope, Spinnin’ Records, Mad Decent, and more, sync deals with 22 Jump Street, Zac Efron’s We Are Your Friends, and MTV’s Teen Wolf, additional collaborations with Steve Aoki and Diplo, and appearances at globally-esteemed festivals like Tomorrowland, Coachella, Lollapalooza, Parrokavile and World Club Dome in Germany and performances at venues like Shrine Auditorium, an ongoing residency at Marquee Nightclub Las Vegas and appearances across Ibiza, Deorro has become a decorated asset to the global dance music community.\n\nEmbracing the heart of his roots, 2022 was another groundbreaking year for Deorro courtesy of his well-received debut Latin LP ORRO. The engaging 19-track album, written entirely in Spanish, bridges the gap between mainstage electronic music and Latin dance music while simultaneously expanding on and innovating his signature style. The Billboard-praised album was followed by his 60-date worldwide Tour De ORRO tour including a string of Los Angeles shows which sold 8500 tickets in just one weekend. If partnering with the Men's Mexican National Soccer team for an 8-date concert series leading to the World Cup wasn’t enough, Deorro also took his live performance to the NFL to dominate a Thursday night half-time show for the Los Angeles Rams. A sought-after collaborator, Deorro performed as direct support for Bad Bunny on his World's Hottest tour, partnered with Tiesto to release “Savage” which garnered 33 million streams in 8 months, and fashioned an official remix for Pitbull’s “Discoteca” which he performed live at Premio Lo Nuestro where he was nominated for DJ Del Año – DJ of The Year.\n\nWith a fearless dedication to crafting intercultural hits and dissolving the boundaries of geography with music, Deorro has already released his 4-track EP Reflect in January of 2023 and will continue transforming the Latin-dance landscape for years to come.",
  "genres": [
    "Progressive House",
    "Electro House",
    "Future House",
    "Dance-Pop",
    "Latin EDM",
    "Big Room House",
    "Trap",
    "Dubstep",
    "Jazz-Swing",
    "Future Bass"
  ]
}