{
  "name": "Dimension",
  "cleanBio": "Robert Etheridge aka Dimension is one of the UK’s most unique electronic music artists. Defined by a clear aesthetic that bleeds through into his music and imagery, Dimension has announced himself as one of the new wave of dance music headliners.\n\nDimension’s combination of seemingly effortless musicality and production prowess first caught the attention of tastemakers and DJs such as Chase & Status, Annie Mac (5x Hottest Records), Skrillex (who remixed the much-lauded ‘UK’), and deadmau5. Over the past few years, he’s built a discography balanced between airwave conquering vocals and underground club anthems; and what was once one of UK dance music’s best kept secret now has a rapidly growing global profile.\n\nReleased on 19 June, ‘Saviour’, is Dimension’s most powerful record to date and the first track from his forthcoming debut artist album. A glimpse into Dimension’s ambitious vision, ‘Saviour’, was co-written with Jem Cooke (Camelphat ‘Breathe’) and features Sharlene Hector (Duke Dumont ‘Therapy’ / Solardo ‘XTC’). The track will precede a run of further singles towards the as yet untitled album release later in 2020.\n\nAfter a remarkable rise since his debut single, Dimension announced himself on the global stage with ‘Desire’, his collaboration with Sub Focus. The record’s list of achievements is near endless; it spent 9 weeks on Radio 1’s playlist (5 on the A-list), has amassed over 50 million global streams to date and has been certified a silver single in the UK by BPI (200,000 sales). Following ‘Desire’ came Dimension’s next string of solo releases, ‘Devotion’ featuring Cameron Hayes, ‘If You Want To’ and ‘Love To Give’ which all rapidly picked up midweek Annie Mac support alongside BBC Radio 1 plays from Phil Taggart’s Hype Chart, Mistajam and Rene LaVice; and together, hitting over 20 million global streams to date.\n\n‘Desire’ was Dimension’s fifth Hottest Record courtesy of Annie Mac on BBC Radio 1, who has been a long time supporter alongside Pete Tong and Danny Howard. Further Hottest Records include his standout collaboration with Wilkinson ‘Rush’ and club anthem ‘UK’. In 2019 he performed at Radio 1’s Big Weekend in Middlesbrough, which was followed by his debut Essential Mix, which was met with critical acclaim. Alongside his original productions, Dimension is also a selective remixer, having reworked the likes of deadmau5, Chase & Status, Nero and Duke Dumont.\n\nIn tandem with his release schedule, Dimension has balanced a hectic global touring schedule that’s included sold out tours across the UK, Europe, North America, Australia, New Zealand and Japan. This is coupled with performances at some of the world’s most acclaimed festivals, including Glastonbury, Reading & Leeds, Tomorrowland, EDC Las Vegas, Pukkelpop and many others, as well as a long-standing residency at Amnesia in Ibiza.\n\nDIMENSION LIVE, his sold out debut live show at London’s prestigious Electric Brixton in October, attracted critical acclaim from Mixmag, RA, DJ Mag, Red Bull, and beyond. The first immersive, multi-sensory experience in dance music, the show debuted Dimension’s showpiece glass mechanical structure - the centrepiece of a production that included a 50-piece state-of-the-art lighting system, laser walls, the largest ever LED screen to be installed in the venue, pyrotechnics and for the first time in a live music environment, scentology. Conceived by Dimension, the show was created in conjunction with INPLAS - a film set and fabrication company whose clients include George Lucas (Star Wars), Ridley Scott (Prometheus), HBO (Game of Thrones), Christopher Nolan (The Dark Knight, Inception), Alex Turner of GravityRigs (The Chemical Brothers and Disclosure live), Liam Mace of DarkMatter, and More Eyes (Stormzy).\n\nFurther shows will be announced in due course, which will include a headline LIVE show at the groundbreaking Printworks London.",
  "genres": [
    "Drum and Bass",
    "Dance",
    "Electronic Pop",
    "Club",
    "Future Bass",
    "House"
  ]
}