{
  "name": "Fcukers",
  "cleanBio": "If the protagonist of Daft Punks ‘Da Funk’ was walking around the streets of New York City today there’d be one thing playing on his boombox and it’d be three piece Fcukers. Whilst on his journey throughout the Lower East Side he’d probably end up running into members of the band working nightlife jobs as DJs, throwing parties in local bars and restaurants or simply finding the frequency of Manhattan’s beat and locking in.\n\nFronted by the energetic and enigmatic Shanny Wise (previously of The Shacks) and backed by producer/night life DJ Jackson Walker Lewis. Fcukers have discovered their own new frequency where a history of playing together and in other projects has led them to syncing on a singular vision built around 90s/00s house music, tasteful trip hop, big beat, indie rock and everything in between.\n\nHaving played only a handful of shows in their short existence Fcukers have managed to unite New York and now London’s night life scenes for exhilarating parties with sold out shows at Baby’s All Right, Drom, Sebright Arms and The Market Hotel… where music fans consisting of it girls and boys, skaters, models, culture seekers and more congregate to tap into the Fcukers frequency and dance the night away. Their recent performance at Market Hotel proving the hype is building around the three piece with the likes of Beck, Julian Casablancas, Clairo and Yves Tumor in attendance, joining the crowd of NYC’s coolest kids to catch an early glimpse of Fcukers.\n\nTheir debut tracks Mothers and Devils Cut are homages to parties gone before them but moreso to the maestros who such parties were built around such as Saint Etienne, Daft Punk, Chemical Brothers, Coldcut, Todd Terry and so many more. Early reception included NYC house legend Junior Sanchez DM’ing the band to remix both tracks… a perfect nod to the forbearers of house music who so carefully built their own frequencies, and ignited a flame for Fcukers to carry onto dancefloors across the globe. They’ve since been tapped on the shoulder by music legends Lol Tolhurst, Budgie, Jacknife and James Murphy to remix their track Los Angeles with the result being an instant dance floor classic reminiscent of DFA’s golden years.\n\nWith only two songs released and a handful of shows under their belt, Fcukers have already garnered plenty of attention from tastemaker artists such as Dom Dolla, Avalon Emerson and Jockstrap performing alongside them across the US. Fashion icon and cultural influencer Hedi Slimane of Celine jumped on Fcukers early, flying the group out to Paris Fashion Week to DJ their closing party. The attention didn’t stop there with the Vans team flying Fcukers out to perform at the House Of Vans and St. Jerome’s Laneway Festival Stages at SXSW Sydney in October. With a stopover to performing in Tokyo they would achieve the feat of having performed their first ten shows across four continents…unheard of in the modern era of music…maybe ever.\n\nEarly praise and radio spins have come from the likes of Apple Music’s Wilko along with BBC 1’s Jack Saunders and Ariel Free with the latter lauding “...really really new this band but getting lots of people very very excited…This one has a real vibe and beat to it, gonna get you dancing”.\n\nWith a handful of performances across the globe on the cards for Fcukers to close out 2023 they’ll be busy digging deeper into their crates as they work on new music to be released in 2024 with the stage set for the rest of the world to tune in.",
  "genres": [
    "House Music",
    "Big Beat",
    "Trip Hop",
    "Indie Rock Electronic Fusion",
    "Techno",
    "Breakbeat",
    "Nu-Disco",
    "Electroclash",
    "Progressive House",
    "Deep House"
  ]
}