{
  "name": "Fury",
  "cleanBio": "Steve Blakley, aka Fury, has been a DJ and promoter in the electronic music scene for over two decades. As a pro snowboarder in the early 1990s, Blakley was able to put his earnings to use as a rave promoter in Denver. Never one to be just a spectator, he bought his own set of turntables and submerged himself in the hardcore techno sound. As the genre evolved, it transformed into Jungle/Drum & Bass, and Blakley became known as Denver’s “King of Jungle.”\n\nAs Fury, Blakley has kept a rigorous travel itinerary, rinsing out high-profile venues from coast to coast. Despite this packed schedule, Blakley continued to expand Denver’s growing dance music community from the event production side as well. The hugely successful Rewind and Reload event series pulled in thousands of Drum & Bass enthusiasts from all over the world, and the weekly series Breakdown Thursdays and later, Gravity Fridays, both became some of the longest-running electronic music nights in the nation.\n\nToday, regular Reload events continue to elevate Denver’s bass music scene. In addition, Fury has remained a regular at many of the nation’s biggest festivals including EDC Las Vegas, Global Dance Festival, Bass Canyon, Forbidden Kingdom, and many more. As a Bassrush and Reload resident, you are sure to see him soon at an upcoming show.\n\nBlakley is also the founder of the internationally acclaimed design company, The Firm Graphics. The Firm was built from the ground up and has grown to become one of the most influential design companies, particularly in the EDM scene, catering currently and in the past to high-profile clients such as Insomniac, Illenium, Kaskade, V2 Presents, and countless others. If you’ve seen promotion for any large-scale festival-style electronic music event in the past 20 years, it’s a safe bet that Steve has had a hand in its design. Throughout his career, Steve Blakley has worn many hats, but underlying it all is a fierce entrepreneurial spirit, a strong work ethic, and an undying love for drum & bass.",
  "genres": [
    "Drum & Bass",
    "Jungle",
    "Hardcore Techno",
    "Bass Music"
  ]
}