{
  "name": "Hannah Laing",
  "cleanBio": "Having cemented herself as a true maven of the peak time banger via a series of high-energy features on the likes of Solardo’s Sola, Patrick Topping’s TRICK, Jax Jones Presents and Spinnin’ Records, a succession of sell-out club nights under her own outfit, plus upcoming shows at the likes of DC10 and Warehouse Project — it’s hard to look away from Dundee born-and-raised DJ and producer Hannah Laing’s unstoppable trajectory to the top. Rapturous new single ‘Climax’ on WUGD joins a slew of big room, blissed-out anthems spanning house, techno and everything in between — including her knockout 2019 bootleg of Sophie Ellis Bextor’s iconic 2001 hit ‘Murder On The Dancefloor’, a rework that earned Laing global acclaim and the notice of some of the biggest names in the business, including FISHER who dropped the track during most sets in 2019.\n\nHaving caught the attention of BBC Radio 1’s Pete Tong, Danny Howard, JAGUAR and Sarah Story, she made her BBC Introducing debut at BBC Radio 1’s Big Weekend in May 2022. She has still found time to develop her own podcast and club night: Hannah’s Choice — with guests such as Hannah Wants, Marc Kinchen, Jax Jones and Ben Helmsley. Hannah credits her prowess as a DJ to her time hustling as an Ibiza resident, having landed her first regular spot at a Scottish bar in San Antonio at the tender age of 19 — going on to play at island institutions DC-10, Amnesia and Hï. This daily grind as DJ — bringing in guests and keeping the energy high no matter how many bodies were on the dancefloor — has given her a keen ability to stretch and manoeuvre a room, ensuring every performance is unique and reactive.\n\nHaving been raised on a diet of Paul Oakenfold, Roger Sanchez and a treasure trove of Hedkandi cassette tapes — all from archives of her rave-loving parents, Laing doesn’t remember a time when she wasn’t surrounded by dance music. Her first encounter with the club was at age 15, an experience that fundamentally affected Laing’s musical outlook; she recalls watching on eagerly as Dave Pearce dropped trance classics such as Delirium’s ‘Silence’. From that day on, Hannah had caught the bug, gaining her first ever DJ gig at 18 at a tiny pub in Arbroath attended by a coach load of her friends and family — from here, she took every opportunity to show off her skills with both hands: weddings, baby showers, birthdays… you name it. Her move from mixing to making music came about through a mixture of opportunity and dedication, first by chance having heard about a fellow Ibiza worker who was giving lessons to budding producers on Ableton — becoming so engrossed in her tuition, she dedicated every day off she had on the island to learn the new skill. Once back in Scotland, she signed up for a course at Escapade Studios and also works with longtime friend Erskine Audio — transitioning from looping basics to full-blown breakdown ecstasy, all with a dancefloor destination in mind.\n\nComing up this year, Hannah Laing has a massive club and festival calendar ahead. Heading back to the White Isle, she’ll be joining Patrick Topping’s TRICK party at DC10 as well as TRICK’s Glasgow instalment at 100 Eastvale — alongside festivals Creamfields, Beatherder and TRNSMT. With features on Data Transmissions Spotlight Mix Series, a peak time mix on Sarah Story’s Future Dance on BBC Radio 1 and many more, expect to hear much more about this rising star this summer.",
  "genres": [
    "Tech House",
    "Big Room House",
    "Progressive House",
    "Techno",
    "House",
    "Dance",
    "Trance"
  ]
}