{
  "name": "INZO",
  "cleanBio": "For INZO, there's a thrill in possibility. The Denver-based electronic artist is less concerned with labels and more with creating immaculate vibes and moving melodies. \"If I could make any and every genre,\" he says, \"I would.\" He lives up to that mission through luminescent synth lines that flutter through his tracks like fireflies, chest-caving bass, and wistful, nostalgic vocal samples. Through it all, no matter what sounds and styles he chooses, he has a constant goal: He wants you to feel something. \"If you're crying, if you're having a fun time, if you're having an epiphany at that moment,\" INZO says, \"sad, happy, whatever — I just want my music to be an experience.\"\n\nHaving last released music in 2020, INZO is currently working on bringing his new and varied experiences to life. In addition to a collaborative EP with fellow dance experimenter LSDREAM, he's preparing his solo EP, Earth Magic. Created during lockdown, its tracks are more cinematic and calmer, with lo-fi beats, piano breakdowns, and transcendent synth beams — a byproduct of his renewed focus on health and wellness. Making music itself has become therapeutic for INZO, so it's fitting that his new work reflects that cozy headspace. As much as he enjoys playing live, he especially loves the quieter, more intimate moments of listening back to a track he's made for the first time and realizing it's exactly what he'd envisioned. \"I like to make music for other people to enjoy,\" he says, \"but at the end of the day it's an expression of me.\"\n\nGrowing up in Chicago, INZO, born Mike Inzano, seemed destined for music. When he was 4 years old, his parents enrolled him in piano lessons where he studied classical greats like Beethoven; at 6, he chose to learn drums inspired by rock groups like Red Hot Chili Peppers. In high school, Inzano found increasing success as part of a metal band. When a potentially career-making opportunity to play Warped Tour fell through, he took it as a sign to move on, go to college, and pursue a medical career. But freshman year, he found rave culture, which pulled him back in. Instead of attending classes, Inzano camped out in the campus music studio and taught himself production, eventually leaving school behind to pursue it full-time.\n\nFor the next two years, INZO tried on different styles, hopping from soaring progressive house (\"High Above\") and raucous electro house (\"Brocaine Camaro\") to a pop-rock-electronic hybrid (\"Young Heart\"). In 2017, he released the single \"Visionaries,\" a hazy track with crashing waves of bass and warm, cascading synth drops. Somewhere in its mellow ambiance and ethereal arrangements, something clicked. \"That was the first time I was sure of my musical identity,\" he recalls. \"Who I wanted to be, the music I wanted to make, the sound I wanted to capture.\"\n\nFollowing that instinct served INZO well. His next single, 2018's introspective \"Overthinker,\" was his most successful to date, recently surpassing 52 million Spotify streams. The bass-heavy track builds on atmosphere, sampling a speech by philosopher Alan Watts that cuts through the dreamy melodies and euphoric synth blooms with sobering musings. Then, inspired to shake up his sound, INZO flexed his range on his 2019 debut EP, Multiverse, delivering stuttering funk on \"Let It Slide,\" laser-charged heaviness on \"Y,\" and blindingly bright melodies on the title track.\n\nAs INZO prepares new music, he's still keen on keeping people guessing. The tracks he's making now are more vivid, softer, and prettier, but he hints at troves of unreleased tracks approaching heavier and more experimental territory — and even more surprise collaborations. What will he put out next? With INZO, anything is possible as long as it's an experience.\n\nDuring a summer full of pivotal performances in 2023 at festivals such as North Coast, Wakaan, Bass Canyon and Sonic Bloom or a coveted headlining night at Mishawaka Amphitheatre, INZO played alongside GRiZ and B2B with LSDREAM, among others while heavy-hitters such as REZZ and Liquid Stranger were airing his tracks out to their crowds.\n\nLeft inspired by the visionaries in the world, INZO started his Visionquest heading into 2024 to pursue his vision of what music can be which all starts where he did as an early producer, in the house music realm with his EP \"Sidequest,\" via Lowly. INZO shares, \"No, I am not \"changing genres\" or am only making house music. This is a \"sidequest\" by name.. sidequest by nature. I just wanted to do a project that felt fun and not too introspective.\"\n\nThe lead single off \"Sidequest,\" \"Bass In Yo Face,\" opens eyes with bass music elements then cracks the dance floor alive with a silky house drop. \"Dopamine\" with LSDREAM orchestrates a sonic conversation with rave energy and unfathomable rhythms, immersing listeners in his signature atmospheric enclave. Then the nonstop funky tech house tune \"Funky Fusion'' defines fun. INZO will have plenty more sounds to explore and unveil along his upcoming Visionquest tour.",
  "genres": [
    "Bass Music",
    "Future Bass",
    "House",
    "Progressive House",
    "Lo-Fi",
    "Chillout",
    "Experimental Electronic",
    "Electro House",
    "Future Funk",
    "Pop-Electronic",
    "Tech House",
    "Dubstep",
    "Ambient",
    "Chillwave",
    "Synthwave"
  ]
}