{
  "name": "it's murph",
  "cleanBio": "The power of music is multi-sensory, and it's murph wants his music to do more than just catch your attention. With each note, it's murph aims to unlock something within the listener, whether it's an emotion, a memory, or an experience; the listener is welcomed to immerse themself into his music.\n\nHailing from Nashville, it's murph, alias of producer Garrett Murphy, is making a splash in the dance world with his euphoric melodies, gritty baselines and sonically expansive atmospheres. His production draws in elements of tech, bass, and heavy dance inspired by artists such as Fred Again…, Cloonee, Chris Lake and Flume.\n\nIn February, it's murph released his debut solo single \"Food For The Soul.\" The track garnered over 4 million streams in a month, landing on editorial playlist such as Spotify's mint, big on the internet, Housewerk etc. Alongside the track murph created a viral social media moment, landing \"Food For The Soul\" in the Viral 50 US chart.\n\nGrowing up in a musical household, it's murph was exposed to various types of music from a young age, taking piano lessons and singing in school choir. In high school, he was exposed to electronic music at a Porter Robinson concert where he fell in love with the ambience that electronic music generated. Wanting to provide that same feeling for others while on stage, he began learning to produce as a sophomore in high school. Upon high school graduation, he moved to LA to attend the University of Southern California. it's murph then fell in love with the never ending energetic groove of house music, making music with his friends in between classes, DJing parties and utilizing social media to share his tracks.\n\nit's murph is set to graduate USC in the spring of 2023 and continue building on the success of \"Food For The Soul,\" and his social channels. On TikTok alone, it's murph has garnered millions of views by teasing his music and sharing live clips, including b2b sets with Dombresky, Noizu, and Dr. Fresch. it's murph is just getting started.",
  "genres": [
    "House",
    "Tech House",
    "Future Bass",
    "Deep House",
    "Bass House",
    "Electronic Dance Music (EDM)",
    "Progressive House",
    "Ambient",
    "Melodic House",
    "Downtempo"
  ]
}