{
  "name": "James Hype",
  "cleanBio": "James Hype is arguably one of the UKs most important artists with his bootlegs and remixes consistently forming the cornerstone UK and international dance floors, alongside his singles regularly clocking tens of millions of streams, being accredited sales awards in the UK, and across Europe approaching half a billion cumulative streams worldwide.\n\nThis success, and James’ larger than life presence across social media and on the road have allowed him to regularly tour up and down the UK’s clubs and festivals, as well as appearing internationally in hot spots including Ibiza, Australia, Germany, Dubai and France to name a few, with dedicated US tours throughout the year. James has also enjoyed arena shows, which include Echo Arena (Liverpool), MEN Arena (Manchester), SSE Wembley (London) and the O2 Arena (London).\n\nJames Hype continues to be one of the UKs most prolific remixers, with highly esteemed official remixes of top artists, including Meduza, Joel Corry, Rita Ora, Anne-Marie and Bruno Mars amassing over one hundred million streams.\n\nFollowing his signing with The Cross Records/ Island Records UK, leading with his single ‘Afraid’ featuring HARLEE, and his follow up ‘Good Luck’ featuring Pia Mia, James Hype continues to secure daytime play listing, tens of millions of streams, and further establishing himself in the US. In between this and his forthcoming third single into his tenure at The Cross Records, James has returned to his roots in the clubs with a string of Beatport top 10 club releases including a collaboration with Vintage Culture and a number 1 chart single with Tita Lau.\n\nWith this, bigger remixes, bigger collaborations and a new tour dates worldwide including a two month US tour planned, James Hype is set to return and remain at the top of UK dance music and solidify his place as a trendsetter and chart mainstay.",
  "genres": [
    "House",
    "Tech House",
    "Deep House",
    "Bass House",
    "Future House",
    "UK Garage",
    "Dance Pop"
  ]
}