{
  "name": "Kaskade",
  "cleanBio": "Grammy-nominated electronic producer Kaskade emerged as one of the most successful American progressive house DJs of the 2000s, pioneering the concept of Las Vegas residencies and selling out arenas across America. With his bright, uplifting dance anthems, he was a steady presence on the U.S. dance charts into the 2010s with Top Ten releases that included chart-toppers Fire & Ice (2011) and Atmosphere (2013). One year later, I Remember (2014) compiled the best of his Ultra years, after which he renewed his contract with the label and released Automatic (2015). During the late 2010s, Raddon began rounding up his singles work into a series of EPs titled Redux.\n\nBorn Ryan Gary Raddon in Chicago, he spent his early days not only as a DJ, but also as an A&R director and record store owner. In the late '90s, he familiarized himself with the rapidly changing electronic music scene, eventually finding that house music was the subgenre he loved best. He DJ'ed in both New York and Salt Lake City, where he would first produce tracks released on his own tiny label, Mechanized Records. He also sold his music to John Elkins, A&R director for OM Records, who later hired Raddon to assist him at the label. By night, Kaskade spun at local clubs and by day helped kick-start the careers of many artists, including Ming + FS and soul-house act Soulstice.\n\nHis own full-length recordings under the Kaskade moniker began with 2003's house-inflected It's You, It's Me. A soulful, more organic direction provided focus for the following year's In the Moment, and Raddon kept his name in the record racks by piloting editions in the San Francisco Sessions DJ series (as well as the label mix House of OM). He proved surprisingly dedicated to his production craft, releasing Love Mysterious in 2006, which placed on Billboard's electronic albums chart. That same year, he parted ways with OM and signed with Ultra.\n\nArriving in 2008, Strobelight Seduction -- featuring production by Deadmau5 -- became his biggest commercial success to date, buoyed by the lead single \"Move for Me.\" Released in 2010, Dynasty celebrated his new reputation with a parade of vocal features and a co-production with Tiësto. It also became his first LP to chart on the Billboard 200. That year, Raddon put together Electric Daisy Carnival, a mix showcasing artists on the bill for the inaugural dance music festival of the same name.\n\nThe double-album Fire & Ice followed in 2011 and debuted in the Billboard Top 20. Featuring a production assist from Skrillex on \"Lick It,\" the effort also included guest vocals from Neon Trees and Skylar Grey. Atmosphere arrived two years later and featured softer, more relaxed music along with vocals from Kaskade himself. After the 2014 compilation I Remember rounded up the best material from his years on Ultra, the DJ renewed his contract with the label and one year later released Automatic. The album featured guest appearances from Estelle, Galantis, John Dahlbäck, and K. Flay, and peaked on the Billboard Electronic chart at number two. In 2016, Kaskade joined Deadmau5 and Skylar Grey on the single \"Beneath Me.\" The following year, he issued the Redux EP 002 (featuring LoKii, Mr. Tape, and Late Night Alumni), as well as the holiday-themed Kaskade Christmas. The DJ then joined Charlotte Lawrence for the 2018 single \"Cold as Stone.\" His third installment of the Redux series arrived in 2019. Redux EP 003 presented a seamless mix featuring Felix Cartal, Gorgon City, and more. ~ L. Katz & John Bush, Rovi",
  "genres": [
    "Progressive House",
    "House",
    "Electro House",
    "Deep House",
    "Trance",
    "Melodic House",
    "Vocal House",
    "Soulful House",
    "Dance-Pop"
  ]
}