{
  "name": "Laura van Dam",
  "cleanBio": "Being labeled ‘The Future of Dance’ by 1001tracklists.com: rising star Laura van Dam, based in Amsterdam, the Netherlands, is making one move after the other. Signing her music to renowned progressive house labels like Anjunabeats, Armada, Epic247 and AFTR:HRS, while playing at the biggest festivals and venues across the globe, including Tomorrowland, Solar, Printworks, Ultra (Europe and Miami), Sunburn, A State of Trance Festival, Parookaville and Ushuaïa Ibiza. With her unique music style combining deep progressive sounds and dark energetic beats Laura is bound to make major waves in her career.\n\nIt all started when a young girl Laura fell in love with electronic music at the age of only 12. Her music career started by winning a famous DJ contest at the Blue Marlin on Ibiza at the age of just 17 years old. After this Laura got inspired to take her career in music serious and she graduated in “Electronic Music Production” and studied “Audio Engineering” at the SAE Institute in Amsterdam. This has helped her develop professionally and allowed her to bring her music and shows to the next level. This paved the way for Laura her first releases on influencing labels in progressive house, like DOORN Records, Protocol Records and Smash Deep. Laura got requested by Deezer to remix a classical peach ‘Moonlight’ from Beethoven in celebration of his 250th Birthday which got released via DOORN records, the imprint by Sander van Doorn, for whom Laura also worked as label A&R.\n\nIn the early dawn of 2022 Laura expended her creative vision and team by signing to Epic247 for her worldwide management and providing her with an open outlet for her music via Epic247 Recordings, allowing Laura to experiment and showcase her first vocal melodic releases, like ‘Into the Light’ and ‘Better Than This’. Which opened the doors for Laura to make her first entrance with ‘Set Me Free’ on the ‘Anjunabeats Rising EP’ by the renowned London based dance record label by Above & Beyond. Immediately following up with her single releases ‘This Love’ and ‘Take Me Away’, all topping the trance & progressive charts, while getting the opportunity to mix the Anjunabeats Rising Residency Mixes. Simultaneously Laura got picked up on Armin van Buuren his radar, siging her track ‘The Journey’, ‘Needing You’ and ‘True Colors’ with Chris Howard to his personal Armind imprint. Leading up to Laura being a frequent main support dj for both Armin van Buuren and Above & Beyond across the globe, including shows at Printworks in London together with Above & Beyond, and Wondersala Riga, Ushuaïa Ibiza and her first full tour throughout India together with Armin van Buuren. Late 2023 laura is making her maiden release on Tiesto’s AFTR:HRS imprint with her long anticipated and powerfull bass driven techno release ‘Dawn’ and closing the year with one of the most sought after ‘IDs’ from last year’s festival season, Laura her ‘Blow the Speakers’ via Epic247 Recordings. Laura van Dam receives support by all the major tastemaker artist in progressive house, techno and trance, like Armin van Buuren, Eelke Kleijn, Dom Dolla, Above & Beyond, Tiësto, Maddix, Farius, Sander van Doorn, Andrew Rayel, MORTEN, Marcus Schulz, Nicky Romero, Oliver Heldens / HI-LO and many more... Keep your eye out for Laura as she is one of the most promising female electronic artists today.",
  "genres": [
    "Progressive House",
    "Trance",
    "Melodic House",
    "Techno",
    "Deep House",
    "Vocal House",
    "Electro House"
  ]
}