{
  "name": "Layton Giordani",
  "cleanBio": "New York’s Layton Giordani stands firm as one of the planet’s most popular tastemakers from techno’s new school. His pioneering musical vision serves as a contemporary voice for the passionate younger generation of cutting edge electronic music fans.\n\nA studio obsessive with absolute dedication to his craft, Layton’s diverse repertoire of sounds today presents a new forward facing soundscape of hi energy techno and underground house aimed firmly at the peak time dance floor.\n\nInspired by the profound experience he had in his teens, of watching the masterful Danny Tenaglia rock Pacha NY all night long, Layton began to hone his own skills behind the decks, eventually landing a pivotal residency at Brooklyn’s iconic clubbing institution Output NY. It was here Layton’s abilities quickly sharpened and where he began to catch the eye of the A list guests playing the venue each week. It was thanks to the initial faith Output instilled in him that Layton then began making a name for himself far beyond America’s east coast.\n\nUnder the mentorship of Adam Beyer, Layton honed his talents further by closely studying the cardinal cuts from techno’s illustrious and rich history. The affiliation resulted in his first EP, Unspoken being signed to Beyer’s Truesoul label which was shortly followed by Rivington, Layton’s debut release on Drumcode, the label that would then become Layton’s home.\n\nIt was in 2017 that Layton Giordani erupted onto the global scene with his aptly-named debut artist album on Drumcode - Where It Begins. This 12-track LP served as the first seismic indication of his talent and capabilities and it subsequently received great critical acclaim from press, peers, fans and the wider industry. Months after the album’s release Layton found himself collaborating with Danny Tenaglia to create Live Again which many today still consider to be one of Drumcode’s contemporary classics.\n\nOne year later and the advancement of Layton’s career showed no signs of slowing as he joined forces with Adam Beyer and Chicago icon Green Velvet to create Space Date which subsequently assembled over 19 million streams on Spotify. This record became the anthem of the summer in 2018 and it marked another pivotal step up in tempo for Layton’s European touring schedule which now included main stage appearances at Drumcode Festival NL, Awakenings, Resistance Ibiza, Melt! Festival, Warehouse Project and many more.\n\n2019 saw more hits as stellar solo EP Phase II landed and after that Layton’s Drumcode hit Chrome. Fuzion - his collaboration with Green Velvet closed the year and went on to be one of the biggest releases for Relief Records.\n\nConsumed with creative aspiration and further seeking to express his unique perspective on the genre, 2020 saw the delivery of Layton’s most complete and robust offering to date, with his sophomore album New Generation. Crafting an immaculate sound through inspirations far removed from techno, he presented an opus that favoured ambiences and immersive urban soundscapes. The LP marked a decisive moment in Drumcode’s evolution, establishing Layton’s nouveau strain of modern techno as a focal part of the label’s output from then on.\n\nLayton’s recent studio work has continued to shine. His Hyperworld EP released during the pandemic (5 million streams on Spotify), his 2022 high-energy collaboration with HI-LO Rabbit Hole (3 mil), the Digital Age EP (2 mil) and his remix of the seminal Sam Paganini hit Rave which he created with Adam Beyer and Bart Skils (6.6 million streams) - all added to his ever increasing growth trajectory.\n\nToday Life Moves Fast for Layton. His incoming Phantom EP for Drumcode is set to ignite dancefloors through the ’23 Festival season and so too is Layton & Zimmz remix of the seminal anthem Olive “You’re Not Alone” which lands on Sony in August. Also incoming is Layton’s dynamic remix of Voicemail by Green Velvet and Patrick Topping which lands in July on Cajual.\n\nDiving headfirst into his music and live appearances with unmatched tenacity, Layton has achieved more in a matter of years than most artists hope for in a lifetime and yet this story is still in its infancy. His unapologetic approach to composition and his hunger for knowledge, sincerity and sonic excellence have ensured Layton’s status as one of techno’s elite in 2023.\n\nRespectful of the past but with his eyes always firmly on the future he continues to entrench himself on the front lines as one of techno’s new school that continues to push forwards with the sounds of tomorrow.",
  "genres": [
    "Techno",
    "Underground House",
    "Minimal Techno",
    "Progressive Techno",
    "Deep Techno"
  ]
}