{
  "name": "LF SYSTEM",
  "cleanBio": "LF SYSTEM's 'Afraid To Feel' is quickly becoming the sound of the summer. After spending three weeks in the UK Top 5, the track has now spent four weeks at #1 making it the first UK dance chart-topper since Joel Corry's 'Head & Heart' in 2020. It has already exceeded 30 million streams and has been certified Silver, while Gold status is well within reach.\n\nBlending modernist disco vibes, towering soul vocals playfully reworked from Silk's 1979 single 'I Can't Stop (Turning You On)' and classic piano house keys, 'Afraid To Feel' was generating steam long before its official release. It first took off with tastemaker support from Jamie Jones, LP Gioppi, Noizu and more, before becoming an airplay smash, which commenced when it was named as Clara Amfo's Hottest Record on Radio 1's Future Sounds. It has been a major airplay hit ever since, first being named as Radio 1's Tune of the Week and then enjoying an extended run on Radio 1's A-list, and becoming the most played track at Radio 1, Kiss FM and Capital. 'Afraid To Feel' subsequently translated to TikTok too with millions of video views.\n\nThe success of LF SYSTEM has played a significant part in the current resurgence of the Scottish music scene. 'Afraid To Feel' reached #1 on the same day that Paolo Nutini topped the album charts with 'Last Night in The Bittersweet' — a moment that Lewis Capaldi celebrated during his headline show at Glasgow's TRNSMT.\n\nLF SYSTEM commented, \"Just over two years ago we played our first show as LF SYSTEM, and just over two months ago we were still working our day jobs. And now we have the first UK #1 dance single since Joel Corry two years ago. No idea how we've gone from releasing disco edits on SoundCloud years to battling it out with Harry Styles, George Ezra, Beyoncé and Kate Bush. Thanks again to everybody who's shown support and love towards us and our music. We will never forget this.\"\n\nThe single's profile has again been boosted with remixes courtesy of Running Back founder Gerd Janson, CID and Tommy Villiers.\n\nConsisting of Conor Larkman and Sean Finnigan, LF SYSTEM met through playing B2B sets at the Edinburgh club night FLY. After sharing those initial disco edits on SoundCloud, they started dropping their own tracks on the platform too with five 'People Want Music' demo EPs. One of those tracks was their first single 'Dancing Cliché,' which picked up early club support from Ewan McVicar, Elliott Adamson, Danny Howard and TSHA. It later received a full commercial release through Warner Records and spent 6 weeks on the Radio 1 playlist.\n\nThe big moments kept on coming, with a sold-out show at Sneaky Pete's in Edinburgh and being named as The Blessed Madonna's One To Watch for 2022. They have also been sought out for official remixes for Fatboy Slim and Carl Cox ('Speed Trials On Acid') and Jodie Harsh ('No Sleep'). And now 'Afraid To Feel' is elevating them from their modest roots to international attention.\n\nLF SYSTEM recently performed at Radio 1's Big Weekend, played their first Boiler Room set at FLY Open Air and now have a big summer of shows ahead of them. Highlights include their first ever London headline show at Night Tales, an Amnesia show presented by Danny Howard, and a huge night at special guests at Gorgon City presents Realm in Liverpool.",
  "genres": [
    "Disco House",
    "Piano House",
    "Nu-Disco",
    "Funky House",
    "Soulful House",
    "Dance",
    "House",
    "Vocal House",
    "Club House"
  ]
}