{
  "name": "Matroda",
  "cleanBio": "Croatian raised producer Matroda is the epitome of electronic music’s fleeting existence. Welcoming house music in his own unique way, with the aptly named ‘matrodasound’ coined by his true fans, the studio sets no limits for this unique but incredibly celebrated artist. Taking early influences from the likes of Led Zeppelin, Frank Sinatra and The Beatles while introducing classical training across the violin, drums and keyboard, the Matroda sound has proven its highly desirable accomplishment around the world over recent years.\n\nFrom shows at EDC Las Vegas and Orlando to Nocturnal Wonderland, Matroda has solidified his presence, both on and off the stage. The natural born DJ and producer has dotted the map with top tier global festivals and sold out shows from Ibiza and Sydney all the way to Los Angeles and more.\n\nHis first career remix of SNBRN’s ‘California’ with Chris Lake, proved an electric festival vibe-chaser gaining support from Diplo, Calvin Harris and Major Lazer, leading to further releases on Mad Decent, Confession and UKF. 2019 saw Matroda dropping one of the album’s of the year and his biggest project to date- ‘THE RED TAPE’, with features from Kaleena Zanders, Dances With White Girls, taking out runner up for best album following AC Slater’s Hi8 at #1. Later in the year his collaboration with Wax Motif on ‘Lose Control’ garnered much support as well as ‘Walk In The Spot’- a true 2019 house anthem. In 2020 Matroda released ‘Forget It’ via Insomniac Records, hitting over 10 million streams to date. Topping the list ‘Disco Tool’ longside Bleu Clair went right to the #1 spot on the Beatport tech house chart, leaving lasting impressions on the industry and dancefloors alike.\n\nFast forward to 2021 when he attained the 25th best producer spot on Tracklist1001’s renowned chart, following a string of Beatport #1’s and over one million monthly listeners on Spotify. A new decade opened up and Matroda’s label Terminal Underground was born, releasing the first EP from himself titled Jack The House EP. ‘La Pasion’ reached top 10 chart status on Beatport’s Tech House Chart, in line with the release of the single ‘Lifting’ with 2022 welcoming ‘Gotta Let You Go’, both on Insomniac Records.\n\nThe Matroda sound is making a solid mark on electronic music enthusiasts around the world, proving the road is only just beginning for this young producer with a promising future ahead.",
  "genres": [
    "Bass House",
    "Tech House",
    "House",
    "Future House",
    "G-House"
  ]
}