{
  "name": "Mau P",
  "cleanBio": "It is not often that an artist of Mau P’s caliber joins the ranks in electronic music. In what can only be described as one of the break-out stories of the decade, Drugs From Amsterdam originator Mau P has indisputably left his mark on the dance music scene since his debut single was released.\n\nBorn Maurits Westveen into a family brimming with musical genius, the artist within was destined to come out at some point. Starting a career as DJ and producer Maurice West, he quickly made his way onto world’s premier stages and into the hearts of many. Despite everything seemingly running smoothly, the Maurice West project had run its course and a seismic shift was in the works. Fast forward to today and Mau P is reaping the rewards of a leap of faith, the wager on his artistry paying off in a spectacular manner.\n\nHis debut single rocketed from the underground to become a huge global hit with close to two hundred million streams across platforms. Drugs From Amsterdam cracked the charts, topped Beatport’s prestigious Top 10 for over a month and turned out to be the beginning of a meteoric upwards trajectory.\n\nMau P released the follow up, Gimme That Bounce, in January 2023, right as he was embarking on his first North America tour. A tour that sold out shows from coast to coast. The summer that followed, Mau P was firing on all cylinders, releasing official remixes for the Swedish House Mafia, Calvin Harris and Armand van Helden as well as his original collaboration with Kevin de Vries, Metro on Afterlife. The latter of which became the most played track of Tomorrowland 2023, only to be followed in second place by Drugs From Amsterdam.\n\nIn 2023 Mau P also released Your Mind Is Dirty and Dress Code, which both turned out hugely successful in their own right. Over the course of his first full year in business, Mau P graced acclaimed stages across the globe, from EDC Las Vegas to Tomorrowland and from Hï Ibiza to Amsterdam Dance Event, winning over fans one beat at a time. It was this foundation of high profile performances and successful releases that set up Mau P for a truly spectacular start to 2024.\n\n2024 has truly been THE year of Mau P – starting the year with a triple threat with the release of BEATS FOR THE UNDERGROUND, a new SiriusXM radio show, XXX Radio, and being added to Wynn Las Vegas’ roster of resident DJs. The year has seen the release of hits including his first vocal track, On Again, with legendary producer Mike Dean, Receipts with Diplo and Gunna, and Merther, featuring the legendary sample from Ini Kamoze’s ‘World A Music’. Not to mention, viral performances from his B2B performance with Diplo on Coachella's new Quasar stage, to bringing the iconic Breaking Bad duo Bryan Cranston and Aaron Paul on stage with him at Encore Beach Club in Las Vegas.\n\n2024 also saw the official introduction of Mau P’s own multidisciplinary show concept, BADDEST BEHAVIOUR, which debuted with an instantly sold-out show in New York’s Knockdown Centre. From there, Mau P brought the concept to Floyd during Miami Music Week, Mission Ballroom in Denver and most notably, sold-out back-to-back takeovers of New York and Los Angeles in September. With FOUR SOLD-OUT shows between Brooklyn’s Under The K Bridge and Los Angeles’s Shrine Auditorium & Expo Hall, the bi-coast installation of Mau P’s BADDEST BEHAVIOUR concept brought more than 25,000 fans flocking to see the icon play.\n\nIt is indeed not often that an artist of Mau P’s caliber comes along, as demonstrated by a jaw-dropping list of accolades achieved in just 18 months. Looking back to August 2022, it’s safe to say that Mau P has broken the mold. As he continues to carve out his section of the dance music industry, Mau P will remain the name to watch for some time to come.",
  "genres": [
    "Tech House",
    "House",
    "Progressive House",
    "Deep House",
    "Melodic Techno",
    "Electro House"
  ]
}