{
  "name": "Dknow (MC Dino)",
  "cleanBio": "Colorado junglists know him as MC Dino, the infamous 8-year resident of Breakdown Thursdays at the Snake Pit, the nation's #1 Drum and Bass club night. The rock star emcee most notorious for his poetic genius with a microphone has commanded crowds at such well known and respected events as Cyberfest, Bassrush, Electric Daisy Carnival and countless other raves and festivals across the United States. Recognized for his high-energy lyrical prowess on the microphone, MC Dino is a crowd favorite on the mic and is an asset to any DJ he rhymes alongside.\n\nAlthough Dino is not his given name, it is his preference and insists that the other is irrelevant. Though born in a small farming community in Northern Colorado, Dino spent time growing up in Mexico and various parts of California before returning to Colorado well over a decade ago. In high school he spent more time writing lyrics, songs, and practicing with bands in backyards than on his schoolwork. He began going to raves when he was 14, a time when raves were new and entirely underground. This exposure had great influence on him; electronic music provided a new medium and mode of tampering with instrumental sound. In this scene he also discovered jungle music and emceeing. Besides the obvious electronic movement that so dramatically shaped his personal musical efforts, Dino's other prominent influences include Prince, Roni Size and Santana. Exposure to these along with an upbringing encouraging all music is especially evident in his individual work, emceeing, and collaborations with Urban Aboriginee.\n\nIn 1997 he set out as an emcee and, inspired by the aggressive new sound jungle provided, used it as an outlet for the poetry streaming through his head. By this time he had already taught himself to dj and moved between rhyming and spinning, while continuing to write his own music. 1998 proved a year of reckoning and direction. He started performing regularly at the Snake Pit on a night then called Plastic Thursdays that offered techno one half of the night and jungle the other. During this period Dino gathered his musically-inclined cohorts and formed a solid group called Urban Aboriginee. The idea behind Urban Aboriginee was to promote the various but sometimes neglected talents (emceeing, DJing, producing, etc) of his intimate circle. The name alludes to modern day tribesmen surviving the streets of a concrete jungle (the city). Urban Aboriginee was recognized throughout Denver for its dedication to Jungle music. For five years, UA sponsored Kombat Battle, a party that allows young deejays and MC's to showcase their talent and provided an opportunity for up-and-comers to perform live in an actual party atmosphere. \n\nIn 2004 Dino was introduced to Divine Elements through the drum n bass scene when he moved to Los Angeles. Fast forward 6 years of non stop MCing for some of the biggest names in the business and the biggest festivals and night clubs across the United States and we find Dino falling into the front man position with D.E. He ended up filling the void Divine Elements had long been waiting to fulfill with a front man MC. Dino was a fluid fit in the dynamic super group. He now is a consistent, positive force in an already solid musical group, touring and writing music with them all the time . \n\nDuring the for mentioned 6 year fast forward between 2004 and 2010, MC Dino has emceed for the greatest names in Drum and Bass, and Dubstep including Andy C, Shimon, Pendulum, Nero, Skrillex, Diesel Boy, AK1200, Dara, Bad Company, Mampi Swift, Teach Itch, and Craze, to name a few. Of course, he performs weekly and nationally as well as being featured on tracks produced by the likes of DJ Icee, Gridlok, Breakdown, Reidspeed, Divine Elements, and DJ Swamp. Other such accomplishments include co-creating Urban Aboriginee Records with his Partner Casey Bonse. Current works include on going production and live performance with Divine Elements, solo projects and audio engineering for various artists in the music community.",
  "genres": [
    "Drum and Bass",
    "Jungle",
    "Dubstep",
    "Electronic Dance Music (EDM)",
    "Techno"
  ]
}