{
  "name": "Mr. Brooks",
  "cleanBio": "One of the most energetic local EDM DJs today, Mr. Brooks does not show any mercy whatsoever when it comes his time to take over the dance floor. Pumping out powerful trance/progressive tracks left and right; he can rock the whole floor and have you screaming for more. He has shared the main stage with many artists such as: Dash Berlin, W&W, Arty, Sean Tyas, Rank1, Tritonal and Aly & Fila.. Be on the look out for him, because this rising artist is not to be missed.\n\n//\n\nMy name is Jovan Brooks (Mr. Brooks). I fell in love with the sound of electronic music at a young age. My first gig at a big backyard house party was what really made me pursue this as a dream goal, to play electronic music for the many people that love to dance. Every time I am on the stage I feel as if I am telling a story through my music. Being on that stage is my freedom of self-expression, a way to let loose. As of recent, I have been learning different ways and doing my own productions in the studio as well as performing on stage alongside international artists.\n\nInterview\n---------\n\n* * *\n\n**Home Town:** Los Angeles, CA  \n**Currently Living:** Riverside, CA  \n**Origin Of Name:** Got tired of thinking of a new DJ name, so I just used my last name and added “Mr.” to it…and then a year later, some movie comes out with my name, funny.  \n**Weapon of Choice:** My mind...it’s loaded with ideas  \n**Source of Power:** Other electronic music artists from around the world that work hard and strive to be on top.\n\n**Was there one particular moment in the recording or mixing process for your Discovery Project entry that made you feel like you were creating something pretty damn special?**  \nDuring the final mix down…I felt that this track was very well “out of the box” than from what I usually listen to or create. Very simple, but mix down and groovy. I felt it was special to experiment with something out of the box and have it come together nicely in the end.\n\n**Are there any dots to connect with where/how you grew up to your musical output?**  \nI just loved a lot of electronic and techno music back in high school so I got a hold of some cheap turntables and did it for fun out of my bedroom. Hardhouse came out, so I started to like it and played at numerous house parties. Then I started to question how this music was being made. So I went out and started messing around with sounds on my computer.\n\n**What do your parents think of what you are doing?**  \nThey love it! They think I’m a mobile wedding DJ or something.\n\n**What’s the strangest part of your job?**  \nSeeing diehard people in the front row dancing like there is no tomorrow to a one-hour plus set. At my age today, I would not be able to keep up.\n\n**What’s the biggest misconception about being a DJ?**  \nEveryone thinks it’s all about going up on stage, pressing a button, and waving your hands in the air (like you just don’t care). But really it’s more about track selection, how to read a crowd, what would you like to hear if you were one of those people in the front row, and how to stand out from the rest. Marketing also comes into play, you have to market yourself if you want to be heard, right? How to bring your brand to the table.\n\n**Tell me about your most memorable night out.**  \nPlaying at Nocturnal Wonderland, 2012. It was such a great feeling to step into my own trailer, pop open a cold one, and relax with a couple of my good friends prior to taking the stage in the “Upside Down” room.\n\n**Do you have any memorable moments from past EDC's or any other Insomniac party?**  \nI really had a blast when I played at the very first Awakening show in San Bernardino years ago. Infected Mushroom and John 00 Fleming headlined.\n\n**How does what you do for a living affect you on a day-to-day basis?**  \nSometimes it can be difficult to switch from one thing to the other—such as having a full-time job, doing graphic design on the side and then trying to jump in the studio right after that. It affects my family and friends a lot because I don’t see them that much because of my schedule. It would be easier if I can just focus on one main thing to make ends meet.\n\n**What is your ultimate career dream?**  \nTo travel the world and play music for the entire human race.\n\n**Are you impulsive with your work or do you have a sketch in mind before you start?**  \nDJing I usually make up my tracklisting a couple days before the gig, and play them in the order that I feel is necessary, sometimes I’ll make a decision on whether to play a certain track next or to drop the next track from a mix. In producing, I usually know what I’m going to put down by humming melodies or weird noises with my mouth. Yes, it’s weird but it does help me get a jump-start on a track.\n\n**How, if at all, does listening to music figure into your creative process?**  \nCertain music that I have not heard before can sometimes make me think on how I can evolve that sound into a different sound and make it sound even better. Tracks that sound really good that have very minimal sounds and are simple seem to get my attention the most.. One of those tracks is “Toxic Rush” by Jewelz & Scott Sparks, after hearing it, I hit the studio.\n\n**What’s the most important piece of gear in your studio?**  \nMy Intel I7 desktop...it’s the core of everything I design and produce.\n\n**How important is it for you to experiment and take on the risk of failure?**  \nVery. Because you might discover something ideal that no one will discover.\n\n**Do you have a list of people you’d like to collaborate with in the future?**  \nMichael Calderone. Mike Targanski. Johnny Yono. Mikkas. These guys have been very influential in what I do. They are the reason I keep on pushing in the studio for many hours trying to develop a sound and to not give up this passion.\n\n**If we pressed Shuffle on your iPod while you went to the bathroom, what would you be embarrassed to come back to us listening to?**  \nProbably some old R&B shit...Don’t hate!\n\n**What sound or noise do you love?**  \nThe kind that is not redlining.\n\n**What should everyone just shut the fuck up about?**  \nSwag.\n\n**What gets you excited when you think about the future of electronic music and club culture?**  \nThe evolving sounds and the growth of electronic music, it has come a long way and changed so much from when I first heard the music.\n\n**When you look at electronic music and the surrounding culture, what worries you about the future?**  \nGhost production that is becoming way too common and easy to get a hold of, as easy as going to a website and downloading a track to call your own when that person has not even created it. This bothers me a lot because there is a lot of great talent out there that are busting their asses in the studio but not really getting the recognition they deserve. Artists should be recognized for the actual projects they create.\n\n**What are your weaknesses?**  \nKryptonite…LOL. I kid, I’m not superman. I would like to think that my greatest weakness is expecting too much from myself on every task I handle. I am learning how to sometimes relax and ask for help where and when I should.\n\n**Do you have a secret passion?**  \nJust one, but it’s not a secret—music.\n\n**Is success physical or internal?**  \nInternal, it means happiness for me. To accomplish and to work towards my dream as long as I keep pushing towards it and making a difference to people in doing what we love.\n\n**What do you remember about your first DJ gig?**  \nI remember I was sweating and very nervous because I did not know what to expect or how the crowd will react to my music. As soon as I got to take over the decks, I don’t remember a thing because the music took control and took over the crowd.\n\n**What’s the hardest professional lesson you’ve learned thus far?**  \nMusic theory, in general. To me that is the most important thing to have under your belt. How to keep sounds in “key” and how to progress and build your sound and arrangement. Main thing is not to be “tone def.” You can have a big track with big sounds, but if it’s all off-key and you got “Arps” going all over the place then it will sound like a pile of crap in the end. I took the time and had to read and watch the same thing over and over in order to finally hit me up-side the head and say, “Ohhhhhh, I get it now.”\n\n**What advice would you offer someone thinking about entering the Discovery Project competition?**  \nDon’t be afraid to think outside the box. Just do it and take your time. Don’t worry too much about today’s sound. Come with what you feel sounds good, be yourself and free your mind.\n\n**Winning Mix:**\n\n**Winning Track:**",
  "genres": [
    "Trance",
    "Progressive Trance",
    "Progressive House",
    "Techno",
    "Hard House",
    "Electro House"
  ]
}