{
  "name": "NGHTMRE",
  "cleanBio": "Los Angeles-based producer, DJ, and label owner Tyler Marenyi best known as NGHTMRE has solidified himself as a global force in modern dance music. In 2015, Skrillex dropped Tyler’s previously unreleased single “Street” on Ultra Music Festival’s main stage - a career defining moment that led to his ascent to stardom as NGHTMRE. Now, 10 years into the project, NGHTMRE is a heavyweight champion in both EDM and hip-hop, with his own Gud Vibrations record label co-curated alongside SLANDER and with release collaborations from ZHU, The Chainsmokers, Gunna, Tory Lanez, A$AP Ferg, Dillon Francis, and more. A philosopher of sound design, his sweltering sets are infused with field recordings and unorthodox samples to create immersive, inimitable listening experiences. With his tenured residency at Hakkasan Las Vegas, headlining performances across Australia, Europe, and Asia, appearances at festivals like Coachella, Bonnaroo, Ultra, Electric Forest along with international events like EDC Mexico, Tomorrowland, Lollapalooza France, Brazil, Chile, Argentina, and performances at legendary venues like Bill Graham Auditorium, Tacoma Dome, Aragon Ballroom, Terminal 5, Grand Park in LA and many more, NGHTMRE is an icon both in the studio and on stage. 2023 saw NGHTMRE collaborating with notable contemporaries like REZZ, Knock2, and Big Gigantic (releasing the eponymous debut EP from the collaborative project, Gigantic NGHTMRE), while also writing the last chapters of his 2022 debut feature-length album DRMVRSE with an 18-track Deluxe Edition accompanied by a mini-documentary chronicling the deep, thoughtful concept of the live-oriented project. As NGHTMRE’s ambitious, B2B double-headliner Sonic Wars tour of North America comes to a close into 2024, he now looks ahead to the new year with lots of music to release and stages around the world to play it live.",
  "genres": [
    "Trap",
    "Dubstep",
    "Future Bass",
    "Bass House",
    "Hip-Hop",
    "EDM",
    "Midtempo Bass",
    "Electro House",
    "Moombahton"
  ]
}