{
  "name": "Noizu",
  "cleanBio": "Los Angeles based Noizu is quickly climbing through the ranks of house music. Making his debut on the Chris Lake and Skrillex curated ‘HOWSLA’ in 2017 with ‘Lasers’ before catching the eyes and ears of French label boss Tchami. His follow up release saw the Jungle EP, an instant live anthem supported by Diplo, Oliver Heldens, A-Trak, Jauz, Malaa and more.\n\n2018 started with singles ‘LFO’ and ‘Wavey’, gaining huge support from Sirius / Diplo Revolution. The latter in particular receiving over 200 plays.\n\nNoizu’s first official remix came when he was asked by DJ Snake himself to tackle his Lauv featured smash ‘A Different Way’, which boasts over 4.8M Spotify streams at present.\n\nA champion for other new talent, Noizu has always given away his own stems post-release to encourage other young producers and has released several remix EPs highlighting the best new talent he can find.\n\nOther official remix offers came in and he selected songs by Tchami and Valentino Khan. He also took the idea of re-working the classic house anthem “Music Sounds Better with You” to his now friend Malaa. The song was released as a bootleg and has had over 1M Soundcloud plays and tens of thousands of downloads.\n\nWith a growing urge to adopt a label boss attitude, he set up Techné Records summer of 2018 with a view to working club releases globally and giving new talent a platform to show their skills. The debut release, a collaboration with Dombresky, could not have gone better. ‘Rave Alarm’ was launched and an instant festival anthem was subsequently made “Hottest Record in the World” by Annie Mac for BBC Radio 1. A top 10 Aria club track in Australia, this track has now been licensed and will receiving a big push with video in 2019. November 2018 saw Noizu make his LA debut, a packed headline show at Sound Nightclub. An incredible landmark for a project barely 18 months old but a true testament to the pace and quality of which the project is heading towards.\n\nCruising straight into 2019, Noizu started off the year with the much-anticipated release of ‘DANCE’ on Chris Lake’s Black Book Records, which quickly gained the support of some of dance music’s top names including FISHER, Chris Lake, Green Velvet, Claude VonStroke and more. After a packed set at Beyond Wonderland, Noizu gifted fans with his second release of the year ‘No More’ which gained the same ongoing traction of everything before it. Having already been played by some of the top DJs at major events around the world including Miami Music Week and Lollapalooza Argentina, this track is not one to be slept on. The year will undoubtedly continue to deliver more top-quality music on a host of respected labels as the ever-growing list of A-List support, co-signs and fan awareness grows.\n\nNoizu is a project that will take over in 2019 and 2020.",
  "genres": [
    "House",
    "Tech House",
    "Bass House",
    "Deep House",
    "Future House",
    "G-House"
  ]
}