{
  "name": "Odd Mob",
  "cleanBio": "For Brisbane based Harry Hope, better known as Odd Mob, there are no limits in sight as he goes from strength to strength with every innovative production. Developing a flair for identifying unique sounds, he has become known for his ability to diversify across genres, emphasizing the unconventional. Spending years meticulously honing his craft, Odd Mob has firmly planted himself at the forefront of electronic music’s future.\n\nOdd Mob broke through with the ubiquitous 2014 track ‘Is It A Banger’, a track that resonated with Australian listeners, charting in triple j’s ‘Hottest 100’ and has since amassed over 7 million streams across platforms. The boundary-pushing producer showed no signs of slowing down, subsequently releasing tracks ‘Intrinsic’, and ‘Lithium’, which saw Odd Mob surpass well over 20 million streams across platforms, not to mention ‘Intrinsic’ collecting a nomination for an AIR (Australian Independent Labels) award in 2019. An ever-present name on the ARIA Club Charts, time and time again Odd Mob has proven his versatility and talent both in the studio and behind the decks.\n\n2022 saw the release of ‘Strut’ where Odd Mob collaborated with House Music icon Roland Clark, as well as an official remake of the timeless Planet Funk classic ‘Chase The Sun’. From remakes, vocal tracks, remixes, and right through to his original productions Odd Mob is non-stop flexing his production prowess. With a genre-defying catalogue of songs, he has given back to his audience fashioning bootlegs under his Oddities brand, which have amassed millions of plays. Constantly pushing boundaries in his expertly crafted creations has earned Odd Mob the support of a plethora of industry heavyweights including the likes of Diplo, DJ Snake, Jauz, Oliver Heldens, Cloonee, Don Diablo, Tommy Trash, and Disclosure.\n\nNo stranger to electrifying heat-seeking crowds, Odd Mob signed with US booking agency, Agency for the Performing Arts (APA) in 2018, sharing the roster with the likes of 50 Cent, Tyga, Dead Letter Circus, Azelia Banks, T.I, The Delta Riggs and Blondie. Odd Mob has since completed an 8 stop tour of the USA and Canada in late 2019, before an additional 11 stop tour in 2020 was scheduled prior to the pandemic. Locally, he has played at some of Australia’s biggest festivals Beyond The Valley, Groovin The Moo, Future Music Festival, Stereosonic, Mountain Sounds, The Big Pineapple and Summer Sounds Sessions.\n\nOdd Mob’s most recent single ‘LEFT TO RIGHT’ has been a huge leap back into the spotlight with a slew of AAA tastemaker support from the likes of Dom Dolla, Disclosure, Diplo, Chris Lake, ACRAZE, and John Summit, to name a few, all showcasing this record in their sets in the past few months, resulting in an online treasure hunt from fans to find the record. The song is based around portions of the Soulja Boy cult classic ‘Crank That’ which has had the blessing and sign off from Soulja Boy himself. ‘LEFT TO RIGHT” is out everywhere from August 12th, 2022.  \n  \n2024 will see Odd Mob continue on his rapid trajectory to the top with a slew of North American back to back tours throughout May, June, August and October, as well as his first ever European tour playing at the likes of Tomorrowland, Parookaville and Elrow @ Amnesia (Ibiza), with more to be announced shortly.",
  "genres": [
    "House",
    "Bass House",
    "Deep House",
    "Progressive House",
    "Tech House",
    "Future House",
    "Electro House",
    "Trap",
    "Future Bass",
    "Trance",
    "Techno",
    "Experimental Electronic"
  ]
}