{
  "name": "OGUZ",
  "cleanBio": "Born and raised in the Netherlands with his roots firmly planted in Turkey, OGUZ has been forging a path in the electronic music scene for almost a decade. Still only in his early 20’s, OGUZ has amassed a dedicated community that fuels his creative journey. Hailing from just outside of Amsterdam, OGUZ has become a driving force in the international Techno scene, captivating audiences with his mesmerizing sets and innovative productions.\n\nHis first encounters with electronic music came in 2016 when attending illegal raves and parties around Amsterdam. OGUZ was instantly drawn to the energy and excitement of electronic music. Inspired by these formative experiences, he embarked on a personal quest to carve out his own sonic path, delving into the intricacies of music production and honing his skills to perfection. Since these early experiences, he has dedicated himself to his craft and growing as an artist.\n\n2017 then saw OGUZ make his debut performance, and what has unfolded over the last 6 years has been a steady rise being built brick by brick. One show, one crowd, one fan at a time. He has played festivals and clubs around Europe, from Belgium to France, Italy to London and Istanbul to Glasgow, OGUZ's performances have transcended borders, drawing a diverse audience with his distinctive sound.\n\nEqually as dynamic behind the decks as he is in the studio, OGUZ’s sound is an ever changing soundscape. Born to push the boundaries of his craft and a commitment to experimentation, OGUZ is continually refining his sound making him impossible to pin down to any one style or genre. With hits like ‘GOLDEN SZN’ and ‘FC Horsepower’ amassing millions of plays in mere months.\n\nOGUZ's journey shows no signs of slowing down. He has shown his creative agility as a multidisciplinary artist spanning a number of genres and musical styles. With a steady stream of releases on the horizon and a community of fans behind him, OGUZ is poised to expand his reach even further and solidify his position as a trailblazer in the genre. Continually pushing the boundaries of his craft, OGUZ remains dedicated to evolving the electronic music scene and leaving an enduring legacy.",
  "genres": [
    "Techno",
    "Deep Techno",
    "Minimal Techno",
    "Industrial Techno",
    "Melodic Techno",
    "Progressive Techno",
    "Acid Techno",
    "Hard Techno",
    "Experimental Electronic",
    "Ambient Techno"
  ]
}