{
  "name": "Paul Oakenfold",
  "cleanBio": "“Pete Tong said it perfectly: getting a release on Perfecto is like a badge of honor,” Paul Oakenfold recalls. “A dance music badge of honor! Those words really meant a lot to me as we began to consider how to properly pay tribute to Perfecto’s first three decades as a record label.”\n\nPete Tong, of course, is dance music’s longtime tastemaker supreme—but don’t just take Tongy’s word for it: in 2003, none other than the late Queen Elizabeth bestowed an award on Oakenfold on behalf of the British Empire as a “Pioneer of the Nation” for his contributions to dance music. All aspects of that legacy are coming together with “Perfecto 30”: an expansive series debuting in 2023-2024 spanning unique global events, musical releases, and exclusive artist/DJ performances that reflect not just 30-plus years of the Perfecto imprint’s success, but the goalpost-moving achievements of Oakenfold, Perfecto’s co-founder and figurehead, as well. Indeed, it’s hard to separate Perfecto’s landmarks from Oakenfold’s storied history as arguably the first global superstar DJ, paving the way from Ibiza and the Glastonbury main stage to smash Las Vegas residencies; as a hit-making producer for everyone from Happy Mondays to Madonna and U2; a pioneer of contemporary electronic music soundtracks for games and hit Hollywood movies like Swordfish and Bourne Identity; and an innovator of DJ culture across genres, crucial in bringing underground club sounds from trance to EDM to a worldwide mainstream audience (and that’s just a partial list).\n\n“Paul’s attitude in starting Perfecto was quite visionary, quite refreshing—I think he started a brand, really, that also happened to be a label,” Tong notes in the upcoming documentary Welcome to Perfecto. “Perfecto 30 is really the umbrella for it all,” Oakenfold explains. In addition to the release of Welcome to Perfecto (which features additional commentary from the legendary likes of Fatboy Slim, Carl Cox, Todd Terry, and David Guetta, along with cultural perspective Mixmag’s Nick Stevenson and DJ Times editor Carl Loben), Perfecto 30 will include a series of remixes and DJ mix recordings featuring everyone Oaky OGs like Carl Cox to new jacks like Franky Wah.\n\nMeanwhile, Oakenfold himself will make a series of special DJ appearances crisscrossing America and the UK to Ibiza and Australia—many involving the parties, festivals, and superclubs like Cream where he made his name; in them, he plans to revisit Perfecto classics and deep cuts like PPK’s “ResuRection,” Planet Perfecto’s “Bullet in a Gun,” and his own smashes like “Starry Eyed Surprise” (the hit collaboration with Crazy Town’s Shifty Shellshock from Oakenfold’s platinum debut solo album, 2002’s Bunkka).\n\nOakenfold also promises a special event at an epic, unexpected venue where dance music has never been played before, which is no small promise. After all, he was the first DJ to play Stonehenge, Area 51, the Great Wall of China, and base camp at Mount Everest—and when he played at the Special Olympics in Abu Dhabi, his set was broadcast to over 760 million worldwide households. “All I can say is we’re looking at one of the oldest cathedrals in England,” Oakenfold notes with a mischievous smile. Most of all, “Perfecto 30” will celebrate the full heritage and influence of the dance-music empire Oakenfold has built—from helping create DJ superstars out of the likes of Hernán Cattáneo, Mark Ronson, and David Guetta to bringing underground dance sounds to fresh ears. “I can honestly say, Perfecto tipped me onto house music,” Fatboy Slim claims, pointing to hearing early Perfecto classic “I’ll Be Your Friend” by house-music legend Robert Owens at a Brighton club as a career-changing epiphany. “I learned trance from Paul Oakenfold,” Todd Terry admits in Welcome to Perfecto, citing his groundbreaking mix CDs like Another World and the Tranceport series. Indeed, with trance revivalists like Evian Christ currently redefining the big room sounds Oakenfold popularized and neo-electronic groups like Sextile exploring the Manchester grooves he helped produce in the studio for Happy Mondays, Perfecto’s diverse sound remains more relevant than ever.\n\nAcross the main Perfecto imprint and its four sub-labels—Perfecto Records, Perfecto Fluoro, Perfecto Black, and Perfecto House—the label has touched nearly every significant dance movement of modern times, from progressive, trance, and EDM but also drum and bass, Balearic, electro, and beyond; as such, on his last artist album, 2022’s Shine On, Oakenfold found himself collaborating with a diverse creative crew including CeeLo, Luis Fonsi, Aloe Blacc, Azealia Banks, and Zhu. Oakenfold points out Perfecto 30 will also launch a number of releases of today’s most cutting-edge dance-music artists and producers including Velvet Cash, Danny Stubbs, Blink, Adam White, and Nat Monday. Oakenfold’s syndicated Perfecto Radio show, meanwhile, still draws 25 million listeners internationally on a weekly basis to hear him spin his latest tunes and dancefloor discoveries.\n\nFor the next chapter of Perfecto, meanwhile, Oakenfold claims he’s returning to the roots of the label’s original mission. “I’m going back to doing straight club records—underground tracks that I love,” Oakenfold says. “You have to understand, Perfecto is now a thirty-year-old brand: there are generations that have grown up with the sound. They got into dance music and have grown up with the label, collecting our vinyl from day one. It’s turned into much more than a label. So to celebrate that spirit, I’m just going to do what I’m good at and really love—and go out in a blaze of glory for my last dance!”",
  "genres": [
    "Trance",
    "Progressive House",
    "EDM",
    "Balearic Beat",
    "Progressive Trance",
    "Electro House",
    "House",
    "Big Room",
    "Breakbeat",
    "Ambient",
    "Techno",
    "Drum and Bass"
  ]
}