{
  "name": "Pryda",
  "cleanBio": "For over ten years, Eric Prydz has been synonymous with immaculately produced and unique sounding electronic music. The Platinum-selling producer is responsible for some of the biggest progressive house tracks of the last decade, not to mention some of the most technically impressive live shows of any touring artist. As a solo artist, Prydz has headlined some of the world’s most storied venues, from Madison Square Garden to Brixton Academy and Alexandra Palace, earned multiple Grammy nominations, hosted an ongoing radio show for Beats1 and topped charts with his alter-egos Pryda and Cirez D. Despite the headline-grabbing shows and releases, Prydz remains reclusive. It’s his dedication to his craft as a producer and DJ that leaves him in the highly enviable and singular position of appealing to dance music’s underground connoisseurs and main-stage masses alike. This appeal is most evident in Prydz’s debut album, OPUS. Its title track graced festival main stages and blacked-out warehouses alike, and its spine-tingling, slow-burn beauty made a fan out of Four Tet, who ended up remixing it for himself. A project ten years in the making, the two-disc, 19-track album balances pop and prog house, and euphoria and melancholy, in a career-spanning capsule that, according to Pitchfork, “confirms him as both a master craftsman and a masterful manipulator of emotions.” OPUS was named one of the best dance albums of the year by Rolling Stone, Billboard, SPIN and more. Prydz began building his craft in Stockholm, Sweden, where he played extended intimate club gigs while constructing his artistic identity. Here, Prydz refined his signature sound, blending together influences as varied as Depeche Mode, Parliament, and Swedish techno legend Cari Lekebusch. It’s little wonder, then, that Prydz has refused to constrain himself to one sound, and indeed is behind two of electronic music’s most celebrated monikers, Pryda and Cirez D. Pryda is Prydz’s most well-known alias, one whose sound is replicated endlessly in dance music. Listen to the discographies of any current electronic music success and you can hear Pryda’s influence -- the ‘Pryda Sound,’ comprised of immaculately layered melodies and harmonies, is now almost a sub-genre unto itself. Pryda’s origins can be traced back to 2004, with the releases of “Aftermath” (2005), “Muranyi” (2007) and “Pjanoo” (2008) solidifying the Pryda name within the new breed of progressive house. The 2012 release of the three-disc album, Eric Prydz Presents Pryda, offers a full retrospective of one of dance music’s most storied discographies. Cirez D offers a stark contrast to the rich melodies of Pryda, its stripped-back techno dark, raw, and designed for ominous warehouses and long, late-night sets. It’s a deliberate point of focus for Prydz, who relishes playing those environments, and Cirez D, like his other monikers, offers him the freedom to make and release the records that he wants to play, unconstrained by expectations. Prydz’s productions are only one half of the story. As a DJ, he’s been celebrated as one of the most consistent live performers around. It’s not only his abilities that set him apart, but the vision behind his performances. In 2011, Prydz debuted EPIC (Eric Prydz In Concert) at London’s Brixton Academy. At its core, EPIC offered a way to visually experience Eric’s music, its pioneering use of holograms and sheer ambition of scale wowing the industry. EPIC’s subsequent iterations have only grown from there: EPIC 2.0 made its way stateside, EPIC 3.0 filled up New York’s iconic Madison Square Garden, while the sold-out EPIC 4.0 tour, earned praise from Resident Advisor for his ability to “create a common ground between a techno fan and a candy raver.” In May 2017, Prydz performed EPIC 5.0 in London, his biggest show to date. Selling 15,000 tickets in under 4 hours was a major achievement for the EPIC series. Summer 2017 also saw Prydz host his debut Ibiza residency, filling Hï Ibiza for 10 weeks throughout the season. He also introduced another bespoke production which was designed and installed by his EPIC team, which proved to be a major success, and more importantly groundbreaking for Ibiza. Residing in Los Angeles, Eric Prydz continues to set himself apart in electronic music through his visceral productions and exhilarating live shows.",
  "genres": [
    "Progressive House",
    "Tech House",
    "Progressive Trance",
    "Techno",
    "Electro House"
  ]
}