{
  "name": "Ray Volpe",
  "cleanBio": "You are witnessing the rise of the Volpetron.\n\nNicknamed “Volpetron” by fans who’ve picked up the name from his producer tag, Ray Volpe excels in every corner of the electronic scene; from video games to the largest festivals in the world, his music can be heard & recognized anywhere. Combining both heavy and melodic influence, along with his own vocals, Ray has created his own unique sound that has earned him support from Excision, DJ Snake, Illenium, and countless other household names from the dance scene.\n\nEDM.com’s Class of 2022 artist Ray Volpe finally released “Laserbeam” in June of last year - one of the most anticipated & sought after IDs of the year. “Laserbeam” has been a breakthrough single for Ray before & after its release, hitting major milestones & becoming the defining Dubstep record of the year. It was crowned the most played track at EDC Las Vegas 2022, reached #1 on Beatport’s Dubstep Chart & #1 on iTunes Electronic Chart, debuted on two Billboard charts - Billboard’s Hot Dance/Electronic Songs Chart & Billboard’s Dance/Electronic Digital Song Sales Chart as one of the few, if not the only dubstep track on the charts at the time of writing, streamed half a million times across platforms in under two weeks of release, garnered tens of millions of views on TikTok & Instagram Reels, with thousands of videos using the track audio, started trending on Twitter, and infiltrated other genres of dance music with high praise & playouts from Skrillex, Chris Lake, Timmy Trumpet, Sub Focus, The Chainsmokers, Dillon Francis, & more.\n\nBy the end of 2022, “Laserbeam” was officially named the #1 most played Dubstep track of 2022 by 1001tracklists as well as the #1 most purchased Dubstep track of 2022 by Beatport. It was even labeled “popular” by TikTok, with the sound attached to an effect.\n\nRay has since released his much anticipated & fan favorite collaboration record with global superstar Marshmello, which immediately hit Billboard’s Hot Dance/Electronic Songs Chart & has been a staple & the opening song of Marshmello’s DJ sets. After triumphantly concluding his massive “Legend of the Volpetron” headline tour, with more than half of the headline dates selling out, he is now gearing up for a world tour in 2023, already selling out dates in Japan & New Zealand. He's also performing as special guest on both Kayzo’s Unleashed XL bus tour & Dabin’s Sanctuary tour while also making festival appearances at Rampage, Rampage Open Air, Sunset Music Festival, Tomorrowland, Beyond Wonderland PNW, Ubbi Dubbi, Ilesoniq, Moonrise, & more.\n\nWinning Electronic Dance Music Awards 2023 for “Best New Artist” and additionally being nominated for “Dubstep Artist of the Year,” Ray Volpe continues to prove why he is a legend in the making.",
  "genres": [
    "Dubstep",
    "Melodic Dubstep",
    "Brostep",
    "Trap",
    "Bass Music",
    "Future Bass",
    "Riddim"
  ]
}