{
  "name": "Restricted",
  "cleanBio": "Rhys Sfyrios, better known as Restricted, is hard to miss online. The 24-year-old, stand-out producer has captivated the digital sphere with an impressive following - over 1 million social media followers, 14 million TikTok likes & 100 million Instagram views. Yet, it's his unwavering dedication to music that truly defines his presence.\n\nHailing from Adelaide, Australia, Restricted has made notable strides in music production, transitioning through various styles before anchoring himself in the Hard techno scene. Taking his fans along for the ride, Restricted delivers content that leaks his personality into his productions. With 100 million+ streams in three years and features on top streaming editorial playlists (including but not limited to: Apple Music’s “Dance in Spatial Audio”, Spotify’s \"Dance Generation\" and \"Hit Dance Floor\"), it’s clear that his ever-growing music journey is just scratching the surface of what’s yet to unfold.\n\nRestricted’s impact extends beyond online music streams and social media metrics. He is expanding the music culture in his hometown, quite literally through his own production and promotion company called ‘Culture.’ Culture events have now filled the missing space in Adelaide’s music scene, with its last sold-out event drawing 5,000 attendees in one of Australia’s toughest markets. The tailored production and curated lineups speak highly of Restricted’s deep understanding within the current music space. Culture continues to be at the forefront of music events in Australia, as one of the premium, must-see festivals.\n\nWith only a few years grinding in the scene, Restricted has built an impressive resume that is continuously expanding. On top of launching his new production imprint, Revive Records, he has rocked stages around the world from steamy, packed warehouses in Europe, Asia, and North America to prominent festivals such as Airbeat One, 808 Festival, Ultra Music Festival Australia, Parookaville, and more. With his notorious hard-hitting basslines and ground-shaking kicks, Restricted continues to evolve his track record as one of Australia’s biggest pioneers in the hard-techno space.",
  "genres": [
    "Hard Techno",
    "Techno",
    "Industrial Techno",
    "Acid Techno",
    "Minimal Techno",
    "Progressive Techno",
    "Deep Techno"
  ]
}