{
  "name": "RL Grime",
  "cleanBio": "An artist's second album is career-defining. The first full-length project serves as an introduction — and, if an artist can deliver on their vision, as Los Angeles-based RL Grime did with hisfirst album, VOID, in 2014 — it is well-received and critically acclaimed. The sophomore album, however, answers the biggest question that any artist faces — not just if they canconsistently deliver, but consistently innovate.\n\nSuch is the stage set for RL Grime's second album. RL Grime first came to prominence as a New York-based teenager delivering monster, viral remixes of Chief Keef's \"Love Sosa\" and Kanye West's \"Mercy.\" He established himself as a unique artist in his space with a striking monochromatic aesthetic, a series of animated music videos, and an annual Halloween mix that has included drops from Goosebumps author RL Stine, comedian Hannibal Buress, and Tony Hawk. After solidifying his fanbase with a few highly-regarded EPs, RL Grime independently released his first studio album, \"VOID,\" in 2014. It premiered as the #1 Electronic album in the United States and remained in that position for a month.\n\nAt that point — with over 150 million plays, rave reviews and magazine covers, and sets at the biggest festivals in the world including Coachella & Lollapalooza — most artists would settle for their success. RL Grime stuck to his underground roots and further limited his releases. He made rare appearances in collaborations with artists including Big Sean, Miguel, and Skrillex, and starred in Alexander Wang's #WANGSQUAD alongside Travis Scott & Zoe Kravitz. In late 2017, he emerged with \"Era,\" a tour-de-force single that Billboard described as \"exotic, massive, and full-of-left-turns.\" Its epic, cinematic sound announced a new era and an accompanying album: NOVA.\n\nRL Grime's uncompromising artistry has paid off. NOVA was preceded by a sold-tour that included stops in Australia, Los Angeles, and New York. Its hype has only swelled in the absence of information surrounding the album, leaving fans and blogs to their own speculation. With NOVA, RL Grime looks to further distinguish himself as an innovator in music, treading the line between millions of fans and an independent sound, the underground and the accessible, popular music and real art.",
  "genres": [
    "Trap",
    "Future Bass",
    "Electronic",
    "Bass Music",
    "Dubstep",
    "Hip Hop",
    "Experimental",
    "House",
    "Art Pop"
  ]
}