{
  "name": "Rusko",
  "cleanBio": "Hello, world: Rusko kindly requests that you wake the fuck up. The Leeds-born DJ/producer who ascended with the original U.K. dubstep movement — and gave it one of its first and most enduring anthems, a bolt of foul-mouthed rave lightning called “Cockney Thug” — is here to tell you that music is not about labels and dance is no fad.\n\nAnd to prove it, he proudly presents “SONGS”: His gutsy, freewheeling, brilliant second album. “The sound of my early releases was very dub-influenced, and just good, fun, bouncy vibes,” he says. “The majority of dubstep at the moment I think is aggressive, and I don’t like angry music; I don’t want to be angry in a club. So I wanted to make something really happy, but still heavy.”\n\n“Happy and heavy” is a proper way to describe the vibe that has carried Rusko from the first moments of dubstep’s life to the biggest stages in the world; from a single, seminal bass wobble to a swath of sounds that can’t be capped in a few simple syllables. He might be one of the guys who started it all — but he’s sure as hell not going to leave it at that.\n\nA staple of the global electronic underground, Rusko has packed nightclubs, concert venues, and festivals across the world, and not only dance-dedicated ones: From Electric Daisy Carnival and Ultra Music Festival, to Coachella and Lollapalooza; from Germany’s Melt! to Australia’s Good Vibrations.\n\nHe created the majority of “O.M.G.!,” his hard-hitting debut artist album, on the road, cutting tracks by day, and testing them on living, breathing dance floors by night. But for the follow-up, he wanted to try a different strategy. “From January to late September 2011, I didn’t make a single track,” he says. “I spent all that time touring around the world, building up a massive swell of ideas inside me.”\n\nWith the long tour done, the artist took two months completely off and ensconced himself in a tiny one-room studio in California’s Hollywood Hills, with no phone reception and spotty-at-best Internet access. The hermit style paid off. “I made all 14 songs in 8 weeks,” he says. “I didn’t try any out like before; I just stayed in the same headspace and vibe, and made the whole album in one go. You can really tell: Compared to ‘O.M.G.!,’ it sounds like one crazy Technicolor song!”\n\nThere is indeed a rowdy kind of sprightliness throughout “SONGS,” which sets a wizard’s box of dance music charms to some of its most misunderstood: cracking, smacking breakbeats, and reverberant, sonic-boom bass. The rave piano vamp of first single “Somebody to Love,” the accelerated classic house of “Pressure,” the head-nodding reggae of “Skanker,” the epically trancey sweep of “Opium” and “Thunder,” even “Dirty Sexy,” a tongue-y but not so cheeky nugget of American-style R&B: They all express a different part of what makes Rusko pogo like a punk while he spins, and carry the energy and soul of his inimitable, genre-be-damned style.\n\nBack in 2007 — when “dubstep” was an idea known to a critical few — Rusko and DJ/producer Caspa lit the spark with a dubstep-dedicated mix for London nightclub Fabric’s influential compilation series Fabriclive. Rusko’s “Cockney Thug” was the centerpiece, evangelizing the bass “wobble” that’s since set the world on fire — a seminal moment that the Guardian UK called one of the 50 key events in dance music history.\n\nThe young artist released a slew of singles and EPs, including the “Babylon” series, which shows his transition from happier rave to heavier dub. Remix commissions came in droves: Rusko has put his buoyant spin on over 20 tracks, including Kid Cudi’s “Day ‘N’ Night,” Lady Gaga’s “Alejandro,” and Kid Sister’s “Pro Nails.” He also produced the majority of “Maya,” M.I.A’s third and highest-charting studio album. In 2010, Rusko’s “Cali Anthem” became the first dubstep tune to be listed on US radio, and “O.M.G.!” was released on Mad Decent/Downtown.\n\nContaining tracks like the raucous “Woo Boost” and elegantly aggressive anthem “Hold On” (featuring Amber Coffman from The Dirty Projectors), it cemented the young artist as one of the leaders of the new dance movement. Rusko is touring internationally behind “SONGS,” and preparing to release an EP with a similarly ingenious group of rule-breakers: American hip-hop outfit Cypress Hill.\n\nSo world, if you’re awake, now hear this: Rusko is here to roll the beats, and dance music will never be the same.",
  "genres": [
    "Dubstep",
    "Brostep",
    "Reggae Fusion",
    "UK Garage",
    "Drum and Bass",
    "Future Bass",
    "Breakbeat",
    "House",
    "Rave",
    "Bass Music"
  ]
}