{
  "name": "Skream",
  "cleanBio": "As one of the UK’s best-loved selectors Skream has enjoyed the kind of consistency most DJs and producers can only dream of. His passion for collecting and playing music is unrelenting; disco, house, techno and everything in between… it runs deep into his core and he lives it every single day. Still only in his early thirties, Skream has achieved more in the last 15 years than most people do in a lifetime, yet his hunger and enthusiasm is akin to that of a man who is only just getting started…\n\nSkream’s history is well documented; a love affair with music that was triggered by his older brother, Hijak. DJing since he was 11. Making music at 15 and one of the key innovators at the birth of dubstep. All before he’d left his teens. With his place in UK music history already assured, he could have easily kicked back and taken advantage of his legendary status. Instead he opted to make the transition to disco, house and techno, leaving the dubstep world to do his own thing, in typical Skream style.\n\nTracks like ‘Rollercoaster’ (ft. Sam Frank) and his remixes of Duke Dumont ‘Need You’ and ‘Infinity’ by Infinity Ink helped introduce the world to Skream’s shift in styles, while his mix output from 2013, cemented the change in direction seamlessly blending a variety of 4x4 styles across all of his tracks. Parallel to these pivotal releases he also showcased his eclectic tastes at his Skreamizm parties across the UK and the rest of the world, and so a new chapter began.\n\nIn November 2013 he closed his infamous label Disfigured Dubz, unveiling a brand new platform called Of Unsound Mind six months later in May 2014. The label’s ethos is simple; to offer an outlet to Skream’s friends and to give support to the underdogs out there. Of Unsound Mind has clocked over 50 releases since it was launched, introducing artists like Motions, Billy Turner, Melody’s Enemy and Osolot to the world. Skream’s philanthropy is the mark of a man who has remained true to himself throughout his career, no bullshit, just a straight up honest, unfiltered attitude.\n\nOn the production tip, he has never stopped pushing out music, utilising his own platform to deliver a slew of techno cuts, encompassing a range of textures; from the rugged to the emotive - including ‘Face Down In The Water’, ‘Settled’ and the mighty ‘Chronicles’ EP with Billy Turner. Elsewhere, he has signed a variety of releases to labels such as Crosstown Rebels, Dennis Ferrer’s Objectivity and We Are The Brave which unleashed his killer track ‘Poison’ in 2018. He’s also produced a constant flow of remixes for major labels like Warner, FFRR and Sony, plus some of the most influential underground outlets, including Hot Creations, Watergate, VIVa, Snatch! and lots more. His endless creativity fueled by the dance floor - the place where his heart lies and where he feels most at home.\n\nFor the last few years Skream has been showcasing the depth of his musical knowledge at his ‘Open To Close’ parties, playing all night long at venues around the world; every step of the way he played at sold out clubs that were packed out with people who were there just for him. Skream’s name is now so synonymous with delivering quality that ravers will happily pay for a ticket to see him play all night simply because they trust in his ability to entertain them for eight hours or more. For Skream, this is a dream come true, the epitome of success.\n\nTo achieve that kind of trust from the dance floor is rare, and to maintain it is even more extraordinary, but Skream is no ordinary artist and his commitment to music, and his fans, is unparalleled. “There was never any other option,” he says, and that is why he will continue to be one of the UK’s most treasured electronic music artists keeping the legacy of UK rave culture alive until the very end…",
  "genres": [
    "Dubstep",
    "Techno",
    "House",
    "Disco",
    "Tech House",
    "Electro",
    "Deep House",
    "Minimal Techno",
    "Progressive House",
    "Garage"
  ]
}