{
  "name": "Steller",
  "cleanBio": "Angelica Bafitis, professionally known as Producer/DJ “STELLER\", has rapidly gained a reputation as one of the most exciting up - and - coming names in electronic music.\n\nThe South Florida based artist's long running passion for music stems early from her childhood but STELLER continued to pursue that passion for music throughout college, eventually receiving a Bachelor's Degree in Music with a concentration in Music Techno logy, and establishing herself as a proficient audio engineer and producer. After college, STELLER began exploring a transition into live performances by DJing at small clubs in Greece, where her family is from. Those performances ignited a fire which prom pted her return to the US where she could further develop her career in a more bass/electronic focused market.\n\nSTELLER’s eclectic and unique sound has often been characterized as a mix of heavy/wonky bass, groovy vibes, and trap beats and is showcased thr oughout her discography. In 2023, her Collaboration with Zingara - ‘Find It In Your Mind’ - surpassed one million streams on Spotify and garnered support from major artists including Clozee and LSDream. Not stopping there, she unleashed her sophomore EP, ‘ Open Your Eyes,’ under the banner of Mersiv’s Morflo Records, and two scorching singles on Insomniac’s Bassrush Records and Boogie T’s Drama Cub Records. It’s no surprise that STELLER’s funky and energetic bass sound has earned her the admiration and respe ct of these heavyweight artists and labels.\n\nSTELLER has proven her skills go far beyond her production abilities with captivating support performances for world - renown DJs including Subtronics, Ganja White Night, and Peekaboo. Those performances catapulte d her into the festival circuit, where the STELLER experience has enchanted audiences at iconic music festivals including Lost Lands, Lollapalooza, Forbidden Kingdom, and Electric Daisy Carnival.\n\nFans will be fully immersed into STELLER's sonic universe through her upcoming release and tour schedule, so keep your eyes, and most importantly minds open. You won't want to miss this!",
  "genres": [
    "Bass",
    "Trap",
    "Wonky Bass",
    "Dubstep",
    "Future Bass",
    "Electronic"
  ]
}