{
  "name": "Sullivan King",
  "cleanBio": "Sullivan King is the under-the-radar rebel with a mighty cause: The Los Angeles-based multi-instrumentalist/producer and solidified guitar god is setting out to shatter the mold and to disrupt the electronic world-one lick at a time. Lifting the brash and rugged energy of bass music off the dance floors and the power of metal and hard rock from the stadiums, Sullivan King creates a musical mosh pit built entirely on rapid-paced, neck-snapping dubstep, intensely shredding guitars and a bold live show that pushes the boundaries of modern music performance. Launched in early 2014, the Sullivan King project is the artistic creation of Keaton Prescott, whose musical DNA is composed of one-half metal and one-half bass music. He initially discovered his love for music in his early teens after his mother encouraged him to pick up a hobby outside of his everyday humdrum. Like the sword of King Arthur, the guitar beckoned; with a fist in the air, he answered the call and never looked back. After discovering the music of Van Halen, via his father, Sully took a headfirst dive deep down the rabbit hole of guitar-based music. He soon discovered the progressive rock sounds of post-hardcore and emo/screamo from the aughts via his brother-at first coming across bands like From First to Last, Chiodos and Atreyu-and then explored the metalcore noise of acts like Escape the Fate, Bullet for My Valentine and Avenged Sevenfold. Altogether, these artists opened the floodgates and laid the foundation for his developing obsession with heavy metal, care of genre icons Pantera, Metallica and the like. Fast-forward a couple of years later when Sullivan King discovered the sounds of EDM after countless hours spent on hardcore gaming, where artists like Skrillex, Avicii, Rusko and Wolfgang Gartner ruled the sound waves across global online gaming communities. It was in 2012 at the now-defunct Sunset Strip Music Festival, however, when he witnessed the analog spirit of punk rock come to life via the digital workings of a DJ and his decks as the notorious Steve Aoki manned the stage. Suddenly, it all clicked. Keaton's newfound love for EDM begot a cultural crossroads where bass music and metal live in a harmonious yet hellish balance. After exploring and perfecting his trademark sound at the revered Icon Collective Music Production School in Los Angeles, he set off to launch his solo artist career. And thus, Sullivan King was born. Today, Sullivan King boasts an inimitable style and sound with no regard to genre confines. His original tracks, remixes and reimagined renditions take the vitality of dance music and run it through the metal machine. The result is a bold, forward-pushing sound that's equal parts electric and heavy. For a taste of the fury, he offers a full-on metal assault in his remake of dubstep classic \"Bass Cannon\" from Flux Pavilion, in which Sullivan King unleashes a relentless salvo of diabolic guitars, screeching solos, double-pedal drums and shrieking vocals. On \"Lockdown,\" a collaboration with The Chainsmokers' drummer Matt McGuire and rapper Sam King, he goes for the jugular as he detonates a bass bomb over dubstep-fueled drops and blazing guitar licks. Elsewhere, his reworks have brought the immense metal touch to numerous EDM anthems, including \"Tremor\" (Dimitri Vegas & Like Mike and Martin Garrix) and \"Kick Out the Epic Motherf\\*\\*ker\" (Dada Life), both remixes with frequent collaborator Riot Ten. Already, Sullivan King has locked in massive collaborations with a number of high-profile producers, including \"Pure Evil\" with Jauz (March 2014), which counts over 1 million plays on SoundCloud to date, and \"Kill It With Fire\" with Ghastly (August 2014), both released on Borgore's Buygore imprint. He's also released a string of powerful original tracks and remixes on several influential independent EDM imprints, including: \"Till We Die\" with KAYZO on Headhunterz's HARD with STYLE (November 2015); \"Fuck It\" with Riot Ten on Excision's Rottun Recordings (December 2016); \"We in Here\" with Nightowls featuring Dan Rudd on Kannibalen Records (February 2017); and his remix collaboration with RYLE of Excision's \"Codename X\" on Rottun Recordings (January 2016). By the end of his debut year, Sullivan King accumulated over 2.4 million plays worldwide, an impressive figure for a new artist by any measure. Additionally, his music production work has been featured in a number of feature film projects, including: the official trailer for the international blockbuster X-Men: Apocalypse; a Spider-Man: Homecoming TV spot; and the trailer for American Made, starring Tom Cruise. On the live front, Sullivan King truly comes to life as he clashes analog traditions with digital attitude via a proper one-man show. His live setup-composed of Pioneer CDJ decks, a microphone, a laptop running Ableton, his faithful Schecter guitar and a Guitar Wing from Livid Instruments, which he uses to manipulate and trigger pre?-recorded loops and sounds-allows him to adapt the best of both worlds into his shows and create unique performances every single time via impromptu guitar solos and varying track selections on the DJ end. His live shows have already gained the attention of the live music and concert industries: He's performed at historic venues, including Avalon Hollywood in Los Angeles and Webster Hall in New York City, and he's also secured official sponsorships with Livid Instruments and Schecter Guitars, where he became the first EDM artist signed to the guitar brand's roster. Sullivan King is today at the helm of a burgeoning musical movement. As one of the few artists to successfully marry heavy metal and electronic music, he's birthed a new creative space all its own. \"If DJs are today's rock stars, then Sullivan King is forging his own rock galaxy,\" agrees LA Weekly (2/19/16). \"I'm taking an idea and creating something I've always wanted to hear in electronic music that wasn't always there: the live element,\" says Sullivan King. \"I wanted to hear people putting guitars and drums and screams and vocals behind electronic music.\" For him, this sound is no gimmick; it's his mission. \"I started this project to make music I wanted to listen to and to fill the gap missing in live electronic music. I'm leading the sound and pushing it forward, because I believe there's something to develop here.\" This year is set to be Sullivan King's biggest and most prolific yet. His release schedule is as busy as ever, with forthcoming projects that include: an official remix of Excision's \"With You\" on Rottun Recordings; a collab EP with Riot Ten (Rottun Recordings); the single \"Break The Rail\" with Dubloadz on prominent bass label Disciple Recordings; his debut solo EP on Kannibalen Records; and collaborations with mega artists Kill the Noise, Snails, and Slander. This fall, Sullivan King is also scheduled to perform at the debut of Excision's Lost Lands festival and is joining electro trio Black Tiger Sex Machine on their West Coast/Midwest Midnight Terror Tour. At a time when the musical realms of electronic and pop churn out cookie-cutter music on the daily, Sullivan King is paving his own path as he pioneers this metal-EDM hybrid sound. He breaks free from the norm and instead opts to remain loyal to his vision like a true artist, regardless of genre and industry trends. And to the haters and non-believers, he raises a fist and a middle finger in the air: Sullivan King has arrived to take the throne.",
  "genres": [
    "Dubstep",
    "Metalstep",
    "Bass Music",
    "Drumstep",
    "Hybrid Trap",
    "Electro House",
    "Hardstyle",
    "Brostep",
    "Riddim"
  ]
}