{
  "name": "TOKiMONSTA",
  "cleanBio": "GRAMMY-nominated producer TOKiMONSTA (Jennifer Lee) has charted a fascinating career over the past decade. She is one of the most revered music producers as one of the pioneers of the seminal 2010 era “L.A. Beat Scene.” As a world-class performer, she ranks as one of the Top 100 DJs worldwide (DJ Mag) and has performed at nearly every major festival worldwide. From her 2010 debut album Midnight Menu to her most recent 2020 album Oasis Nocturno, her entire discography has drawn critical praise from NPR, BBC, LA Times, NY Times, DJ Mag, Rolling Stone, Billboard, Pitchfork and more. As it stands, her list of collaborators includes Anderson .Paak, EARTHGANG, Ryuichi Sakamoto, Yuna, ZHU, Bibi Bourelly, The Drums — and up-and-coming artists she seeks out to mentor. With over 400 million streams and counting, she remains in demand having remixed the likes of David Bowie, Sia, Beck, Duran Duran, Portugal the Man, Disclosure, ODESZA and Ólafur Arnalds.\n\nFollowing her second album Half Shadows, TOKiMONSTA established and began releasing on her own label Young Art Records. Minialbums, Desiderium and FOVERE both featured artist Anderson .Paak and some of her most belovedsongs to date. After anchoring her label with her GRAMMY nomination, Young Art has continued to soar with notable releases being Rochelle Jordan’s Juno Award-nominated album Play with the Changes featuring production by KAYTRANADA, Jimmy Edgar and Machinedrum, and critically acclaimed album Svengali by Cakes da Killa (rated 4/5 stars by The Guardian).\n\nAt the end of 2015, her career temporarily came to a halt after being diagnosed with a rare and fatal cerebral vascular disease known as Moyamoya. After undergoing two consecutive brain surgeries, TOKiMONSTA was left with acute aphasia, meaning she could no longer verbally communicate. She soon discovered she had also lost the ability to comprehend the thing most important to her, music. Through perseverance and healing, her cognitive and creative faculties returned. Her Moyamoya journey gained more wide-spread attention after starring in the first season finale of the Netflix series Vox, Explained.\n\nAfter her recuperation, she made a triumphant comeback with a jaw-dropping performance at Coachella and a new body of work, her critically acclaimed album, Lune Rouge. Her third full-length album was nominated for ‘Electronic Album of the Year’ by the Recording Academy at the 2019 GRAMMY Awards. More than just an accolade, her nomination was an astounding achievement as she was the first Asian American producer and first female producer ever nominated in the category.\n\n2020 brought a deeper evolution as TOKiMONSTA shared her fourth full-length album, Oasis Nocturno. It highlighted her effortless flow between the stylings of house, soul and hip-hop. Following her album, her single “The Flower Blooms\" was a focus track on Netflix’s Squid Game (Let’s Play) EP. Right after the release of her official remix for David Bowie’s 1975 hit “Golden Years,” she went on to win Best Remix from DJ Mag for her remix of Sia and Neneh Cherry’s “Manchild.” Most recently, she released \"Eats The Tale\" on Young Art Records, a genre-bending track with label-mate Rochelle Jordan. The single was showcased in Times Square NYC by Spotify for New Music Friday. The rest of 2023 has her continuing her Booms & Blooms tour globally and preparing for more new music in 2024.\n\nTOKi has now entered the world of tech, having co-founded a music tech startup by the name of Sona. The aim of Sona is to democratize music streaming for artists in a world where the pay per stream is not adequate for a musician’s cost of living. The protocol and platform will reconstruct the scaffolding of music streaming so that audiences still have access to all the music they desire, while allowing artist’s payout to equate to what they truly deserve. After a successful seed round in 2022, the company is aiming to launch late 2023.",
  "genres": [
    "Electronic",
    "Hip-Hop",
    "House",
    "Soul",
    "Experimental",
    "Future Beats",
    "Chillwave",
    "Trip-Hop",
    "Downtempo",
    "Indie Electronic",
    "Dance"
  ]
}