{
  "name": "Vini Vici",
  "cleanBio": "Aviram Saharai & Matan Kadosh / Vini Vici (pronounced “Vini Vichi”). “Few acts have such a well-defined signature sound” - quoting none other than trance icon Armin Van Buuren, when asked to describe the Vini Vici duo.\n\nAlthough the Vini Vici jam is labeled as Psytrance, their cataclysmic, yet authentic & mesmerising sound took them way beyond the psychedelic world spectrum. Propelled by their infinite ambition and childhood dream, the innovative duo mange to shatter the glass ceiling of the psychedelic scene, leading the tribe into a new era.\n\nVoted #72 by “Dj Mag Top 100 Dj’s” (2017) , The No. 1’s / Walla Nightlife Awards ‘Dj Of The Year’ (2017), Beatstats “Best Selling Psytrance Artist” (2015, 2016, 2017), and #12 on “Trance Podium Top 100 Dj’s” (2017), these are merely a part of the accomplishments already under their belt. A long list of collaborations with some of the world's leading DJs pays testament to the powerful impact the Vini Vici sound has had on the global electronic music market. Armin Van Buuren, Dimitry Vegas & Like Mike, Steve Aoki, W&W, KSHMR, Astrix, Timmy Trumpet... to name but a few.\n\nA glimpse into Vini Vici Tour dates reveals a glittering list of some of the world most desirable events; Tomorrowland, EDC (Las Vegas, Orlando, Mexico, India, Japan), Ultra (Miami, Brazil Europe), Dreamstate, ASOT, AMF, Dreambeach, Creamfiled, Electric Love, Airbeat One, World Club Dome, Transmission, Electronic Family, 808, DLDK, Sunburn, Boom, Psy-Fi, XXXperience, Tribe, Mandallah, Alien Trip, Sonora, Insonia, Unity, Psychedelic Experience, Indian Spirit, Burning Mountain, Vuuv........ Despite their overwhelming schedule (with an average of over 200 shows per year), Vini Vici maintain their high energy pulse in the studio, repeatedly delivering pounding hits like: “Free Tibet Remix”, which is the all-time most viewed psytrance song with nearly 60,000,000 views on Youtube, and the first song ever to make it into Beatport overall Top10 chart (#2).\n\nFollowing was their already anthem “Great Spirit” - a collaboration with “Armin Van Buuren & Hilight Tribe”, and dancefloor dominator “Chakra” collaborated with W&W, both gaining spectacular success on Youtube, Spotify, Beatport (#3 overall, #2 overall) and positioned as the most played tracks (#1, #2) at Tomorrowland Festival 2017.\n\nFusion with some of the biggest names in the game didn't steer Vini Vici away from their underground roots, and they continue producing with a an edgy, psychedelic feel. Where The Heart Is, Veni Vidi Vici, Adhana, Ravers Army, Universe Inside Me, Colors, In & Out, and Flashback depict just a partial list of their forever dominant psychedelic sound.\n\nBeyond all the successes, the most admirable thing about Vini Vici is that no matter how big or far they go, they always maintain their down to earth attitude, positivity and gratitude, proving one thing for sure: good vibes win.\n\n#JoinTheTribe",
  "genres": [
    "Psytrance",
    "Progressive Trance",
    "Goa Trance",
    "Trance",
    "Electro House",
    "Big Room House"
  ]
}