{
  "name": "Walker & Royce",
  "cleanBio": "For Sam Walker and Gavin Royce, the question is the fundamental test of their studio output. Simple as it may sound, for this perfectionist pair it’s anything but. Their innate dance floor intuition, combined with years of experience behind the decks, drives them to create music that isn’t just playable — it’s irresistible.\n\nFirst introduced by way of New York City's early-aughts dance music scene, Sam Walker and Gavin Royce first teamed up for a remix in 2011. The duo found early success on tastemaker labels like Crosstown Rebels, OFF Recordings, and Moda Black, scoring an Essential New Tune nod from Pete Tong with 2014’s “Sister.” The indie dance and deep house sounds that informed Walker & Royce’s earliest work soon gave way to something different. Quirky accents and bouncy synths, previously deeper in the mix, leapt to the forefront, backed by a propulsive new energy. The success of their November 2015 “Bright Lights” remix was a clear indication that they were onto something.\n\nIn October 2017, Walker & Royce released their debut album Self Help on Dirtybird, which both showcased and expanded upon their now-signature sound. The guys enlisted numerous vocalists, including Green Velvet, Dances With White Girls, and Sophiegrophy, to make Self Help feel like a packed house party – while leaving no doubt about who was hosting. Self Help was followed by further experimentation and growth. Sam and Gavin have collaborated with Ardalan, Chris Lake and VNSSA; remixed The Knocks and Justin Jay; and put out music on Relief, Black Book, HotBOi Records and more. Now, their new Rave Grave EP is the inaugural release on Diplo’s house-focused imprint Higher Ground.\n\nWalker & Royce have spent years honing in on their one-of-a-kind style, meticulously crafting the sounds they want their fans to hear in clubs, at festivals and in their headphones. The result is a cohesive, career-defining body of work that firmly places the duo at the forefront of dance music's future.",
  "genres": [
    "House",
    "Tech House",
    "Deep House",
    "Indie Dance",
    "Techno",
    "Bass House",
    "Funky House"
  ]
}