{
  "name": "Yoji Biomehanika",
  "cleanBio": "In the late ’70s, he immersed himself in advanced music such as noise, music concrete, and overdubs. Later, he resonated with the futurist movement that rolled out in the ‘80s amidst the evolution of digital technology in the form of MIDI. He found his identity in its technology-oriented, danceable sound-making and alternative appearance.\n\nIn the early ‘90s, he started his career as a dance music producer and DJ “YOJI BIOMEHANIKA”. He released numerous works on edgy labels in Germany and the U.K. as well as in Japan, and quickly gained attention. He rose to stardom as a leading figure in NU-NRG and created a following known as “Hanikers”.\n\nThe arrival of the ‘00 Millennium. NU ERA was filled with expectations for the dawning of a new future. YOJI BIOMEHANIKA expanded the stage of his activities globally, launching the label “HELLHOUSE” with London as its distribution base, and released a series of 12-inch singles of his original tracks. Each release has made the charts. He has released many DJ MIX compilations in Japan and abroad, handpicking a list of popular DJs.\n\nIn 2001, he released his first artist album “TECHNICOLOR NRG SHOW” from avex (released overseas by ID&T in the Netherlands) and the first Japanese DJ live DVD “TECHNICOLOR NRG SHOWCASE” in Japan. With a powerful stage presence and a string of original works that have become global anthems, he has jet-set across the globe to Western and Eastern Europe, Central and Eastern Europe, North America, Southeast Asia, and Oceania, where he broke out with an unprecedented run of performances including Mysteryland, Defqon-1 Mysteryland, Defqon-1, Dance Valley, Tomorrowland, In Control, EDC, Creamfields, too numerous to enumerate..(see “Primary Festivals and events that YOJI appeared in the past” as bellow).\n\nHe was the headliner at Sensation Black in Amterdam for a groundbreaking two years in a row, and has frequently ranked in the DJ Mag Top 100, climbing to the unparalleled 32nd position for a Japanese artist. In 2003, he won the Grand Prix at the Hard Dance Awards, established in the U.K. in its first year, and in 2011, he won two awards, Outstanding Contributions and Best International DJ in Asia, in recognition of his contribution to the scene. His achievement in bringing hard electronic dance music from the underground to the mainstream market is a milestone in music history, and is one of the reasons why he is called an industry legend.\n\nHe has been performing under the artist name “YOJI” (without “BIOMEHANIKA”) since 2007, and has been advocating a hybrid music style “Tech Dance” that shifts more toward techno. He had many hits such as “SIX HOURS“, “TECHY TECHY“, “AIRPORT“, and others. After about 7 years of musical exploration under this style, he returned to his identity as a melodic big room sound.\n\n‘15 He has rebooted as YOJI BIOMEHANIKA with a full heart. Released his 3rd album “CHAPTER X” from avex EDM, his first album in 11 years, and all the single cuts from the album ranked high on iTunes. In 2016, he launched the “BANGINGLOBE” label (under dieTunes) as a platform for overseas. Releases from avex in Japan are developed overseas from there, and each release is on the world dance charts. All three parts of the digital album “A QUARTER CENTURY OF YOJI BIOMEHANIKA“, a compilation of Yoji’s musical history released at the end of 2017, ranked in Beatport’s Top 5 albums.\n\n‘18 Rework of one of his signature track, “HARDSTYLE DISCO (2018 REVERSE BASS EDIT)” was released and received a GOLD on DJ Mag review. The track is a huge anthem that continues to be loved by many artists around the world, and NWYR (W&W) performed a cover of the track at Tomorrowland in 2017, where it became a scene sensation. The remix by Da Tweekaz and Sub Zero Project was released on avexEDM in Japan and DirtyWorkz in Belgium, and became a mega hit.\n\nIn the same year, he supervised the production of Japan’s first major hardstyle compilation “BANGINGLOBE PRESENTS SUPER HARDSTYLE” (avexEDM), which reached number one on the iTunes dance chart on its first day of release.\n\nPost-Corona Under the pandemic, YOJI has begun to face himself deeply and develop his activities to pursue his own personality. He has updated many of the songs he has written over the course of his 30 years of activity, and is now ready to demonstrate the true value of YOJI BIOMEHANIKA as an artist.",
  "genres": [
    "Hardstyle",
    "Tech Dance",
    "Nu-NRG",
    "Hard Trance",
    "Hard House",
    "Techno",
    "Big Room House"
  ]
}